MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_fdcan.c
  * @brief   FDCAN HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Flexible Data-rate Controller Area Network
  *          (FDCAN) peripheral:
  *           + Initialization and de-initialization functions
  *           + I/O operation functions
  *           + Peripheral Configuration and Control functions
  *           + Peripheral State and Error functions.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined(FDCAN1) || defined(FDCAN2)
#if defined(USE_HAL_FDCAN_MODULE) && (USE_HAL_FDCAN_MODULE == 1)

/** @addtogroup FDCAN FDCAN
  * @{
  */
/** @defgroup FDCAN_Introduction FDCAN Introduction
  * @{

The FDCAN hardware abstraction layer provides a comprehensive software interface to support the communication
protocol on STM32 microcontrollers.
FDCAN (Flexible Data-rate Controller Area Network) is an advanced communication protocol that extends the classical
CAN protocol to support higher data rates and improved error handling capabilities.
It is designed to meet the requirements of modern automotive and industrial applications.

This peripheral conforms to CAN protocol version 2.0 part A, part B, and ISO 11898-1.
This HAL driver abstracts low-level hardware details, enabling configuration, data transfer, and interrupt handling,
thereby accelerating development and ensuring robust and scalable embedded applications leveraging the full
capabilities of the CAN-FD bus.

  */
/**
  * @}
  */

/** @defgroup FDCAN_How_To_Use FDCAN How To Use
  * @{

# How to use this driver

1. Declare a hal_fdcan_handle_t handle structure and initialize the FDCAN driver with an FDCAN instance.

2. Initialize the FDCAN peripheral using the HAL_FDCAN_Init() function. The FDCAN clock is enabled inside
   HAL_FDCAN_Init() if USE_HAL_FDCAN_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO.

3. Configure the low-level hardware (GPIO, CLOCK, NVIC, etc.)
- Enable the FDCAN clock if USE_HAL_FDCAN_CLK_ENABLE_MODEL = HAL_CLK_ENABLE_NO
- FDCAN pins configuration:
  - Enable the clock for the FDCAN GPIOs
  - Configure the NVIC for interrupt processing

4. Configure the peripheral using the HAL_FDCAN_SetConfig()
- If needed, the kernel clock divider can be changed by the first instance after the global configuration
  using HAL_FDCAN_SetClockDivider(). Only the first instance is allowed to modify the divider.
- If needed, configure and retrieve the reception filters and optional features using the following configuration
  functions:
  - HAL_FDCAN_GetConfig()
  - HAL_FDCAN_SetNominalBitTiming()
  - HAL_FDCAN_GetNominalBitTiming()
  - HAL_FDCAN_SetDataBitTiming()
  - HAL_FDCAN_GetDataBitTiming()
  - HAL_FDCAN_SetClockDivider()
  - HAL_FDCAN_GetClockDivider()
  - HAL_FDCAN_SetFilter()
  - HAL_FDCAN_GetFilter()
  - HAL_FDCAN_SetGlobalFilter()
  - HAL_FDCAN_GetGlobalFilter()
  - HAL_FDCAN_SetExtendedIdMask()
  - HAL_FDCAN_GetExtendedIdMask()
  - HAL_FDCAN_SetRxFifoOverwrite()
  - HAL_FDCAN_GetRxFifoOverwrite()
  - HAL_FDCAN_SetRamWatchdog()
  - HAL_FDCAN_GetRamWatchdog()
  - HAL_FDCAN_SetConfigTimestampCounter()
  - HAL_FDCAN_GetConfigTimestampCounter()
  - HAL_FDCAN_SetConfigTimeoutCounter()
  - HAL_FDCAN_GetConfigTimeoutCounter()
  - HAL_FDCAN_EnableTimeoutCounter()
  - HAL_FDCAN_DisableTimeoutCounter()
  - HAL_FDCAN_IsEnabledTimeoutCounter()
  - HAL_FDCAN_SetConfigTxDelayCompensation()
  - HAL_FDCAN_GetConfigTxDelayCompensation()
  - HAL_FDCAN_EnableTxDelayCompensation()
  - HAL_FDCAN_DisableTxDelayCompensation()
  - HAL_FDCAN_IsEnabledTxDelayCompensation()
  - HAL_FDCAN_EnableISOMode()
  - HAL_FDCAN_DisableISOMode()
  - HAL_FDCAN_IsEnabledISOMode()
  - HAL_FDCAN_EnableEdgeFiltering()
  - HAL_FDCAN_DisableEdgeFiltering()
  - HAL_FDCAN_IsEnabledEdgeFiltering()
  - HAL_FDCAN_SetMode()
  - HAL_FDCAN_GetMode()
  - HAL_FDCAN_EnableRestrictedOperationMode()
  - HAL_FDCAN_DisableRestrictedOperationMode()
  - HAL_FDCAN_IsEnabledRestrictedOperationMode()
  - HAL_FDCAN_SetFrameFormat()
  - HAL_FDCAN_GetFrameFormat()
  - HAL_FDCAN_EnableAutoRetransmission()
  - HAL_FDCAN_DisableAutoRetransmission()
  - HAL_FDCAN_IsEnabledAutoRetransmission()
  - HAL_FDCAN_EnableTransmitPause()
  - HAL_FDCAN_DisableTransmitPause()
  - HAL_FDCAN_IsEnabledTransmitPause()
  - HAL_FDCAN_EnableProtocolException()
  - HAL_FDCAN_DisableProtocolException()
  - HAL_FDCAN_IsEnabledProtocolException()
  - HAL_FDCAN_SetTxMode()
  - HAL_FDCAN_GetTxMode()
  - HAL_FDCAN_GetClockFreq()

5. Operation Modes
- FDCAN communication is primarily handled in interrupt (IT) mode.
After configuring the peripheral and enabling the necessary interrupts, the application starts the FDCAN module.
Events such as transmission complete, transmission cancellation, or message reception are handled asynchronously via
their respective callbacks (e.g., HAL_FDCAN_TxEventFifoCallback(), HAL_FDCAN_TxBufferCompleteCallback()).
The interrupt configuration sequence is as follows:
  - Enable individual interrupt sources using HAL_FDCAN_EnableInterrupts().
  - Map interrupt groups to an interrupt line using HAL_FDCAN_SetInterruptGroupsToLine().
  - Enable the selected interrupt line(s) using HAL_FDCAN_EnableInterruptLines().
The status of individual interrupt sources can be checked with HAL_FDCAN_IsEnabledInterrupt(), and the status
of interrupt lines can be checked with HAL_FDCAN_IsEnabledInterruptLine().

