MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
/** @defgroup FDCAN_Configuration_Table FDCAN Configuration Table
  * @{
10. Configuration inside the FDCAN driver

Software configuration defined in stm32c5xx_hal_conf.h:
Preprocessor flags               |   Default value   | Comment
-------------------------------- | ----------------- | ------------------------------------------------
USE_HAL_FDCAN_MODULE             |         1         | Enable HAL FDCAN driver module
USE_HAL_FDCAN_REGISTER_CALLBACKS |         0         | Allow the user to define their own callback
USE_HAL_CHECK_PARAM              |         0         | Enable runtime parameter check
USE_HAL_FDCAN_CLK_ENABLE_MODEL   | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
USE_HAL_CHECK_PROCESS_STATE      |         0         | Enable atomicity of process state check
USE_HAL_MUTEX                    |         0         | Enable semaphore creation for OS
USE_HAL_FDCAN_USER_DATA          |         0         | Add a user data inside HAL FDCAN handle
USE_HAL_FDCAN_GET_LAST_ERRORS    |         0         | Enable retrieval of the last process error codes

Software configuration defined in preprocessor environment:
Preprocessor flags               |   Default value   | Comment
-------------------------------- | ----------------- | ------------------------------------------------
USE_ASSERT_DBG_PARAM             |    Not defined    | Enable check param for HAL
USE_ASSERT_DBG_STATE             |    Not defined    | Enable check state for HAL

  */
/**
  * @}
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup FDCAN_Private_Constants FDCAN Private Constants
  * @{
  */

/*! LUT with Data Length Code (DLC) values to corresponding number of bytes */
static const uint8_t fdcan_lut_dlc2bytes[] = {0U, 1U, 2U, 3U, 4U, 5U, 6U, 7U, 8U, 12U, 16U, 20U, 24U, 32U, 48U, 64U};

#define FDCAN_IR_MSK       (FDCAN_IR_RF0N | FDCAN_IR_RF0F | FDCAN_IR_RF0L | FDCAN_IR_RF1N | FDCAN_IR_RF1F          \
                            | FDCAN_IR_RF1L | FDCAN_IR_HPM | FDCAN_IR_TC | FDCAN_IR_TFE | FDCAN_IR_TEFN            \
                            | FDCAN_IR_TEFF | FDCAN_IR_TEFL | FDCAN_IR_TSW | FDCAN_IR_MRAF | FDCAN_IR_TOO          \
                            | FDCAN_IR_ELO | FDCAN_IR_EP | FDCAN_IR_EW | FDCAN_IR_BO | FDCAN_IR_WDI | FDCAN_IR_PEA \
                            | FDCAN_IR_PED | FDCAN_IR_ARA | FDCAN_IR_TCF) /*!< FDCAN interrupts mask */

#define FDCAN_IE_MSK       (FDCAN_IE_RF0NE | FDCAN_IE_RF0FE | FDCAN_IE_RF0LE | FDCAN_IE_RF1NE | FDCAN_IE_RF1FE \
                            | FDCAN_IE_RF1LE | FDCAN_IE_HPME | FDCAN_IE_TCE | FDCAN_IE_TFEE | FDCAN_IE_TEFNE   \
                            | FDCAN_IE_TEFFE | FDCAN_IE_TEFLE | FDCAN_IE_TSWE | FDCAN_IE_MRAFE | FDCAN_IE_TOOE \
                            | FDCAN_IE_ELOE | FDCAN_IE_EPE | FDCAN_IE_EWE | FDCAN_IE_BOE | FDCAN_IE_WDIE       \
                            | FDCAN_IE_PEAE | FDCAN_IE_PEDE | FDCAN_IE_ARAE | FDCAN_IE_TCFE) /*!< FDCAN interrupts enable mask */

#define FDCAN_ILS_MSK      (FDCAN_ILS_RXFIFO0 | FDCAN_ILS_RXFIFO1 | FDCAN_ILS_SMSG | FDCAN_ILS_TFERR | FDCAN_ILS_MISC \
                            | FDCAN_ILS_BERR | FDCAN_ILS_PERR) /*!< FDCAN interrupts group mask in ILS register */

#define FDCAN_GLOBAL_TIMEOUT_MS (10U) /*!< 10ms timeout */

#define FDCAN_TX_EVENT_FIFO_MSK (HAL_FDCAN_FLAG_TX_EVT_FIFO_ELEM_LOST | HAL_FDCAN_FLAG_TX_EVT_FIFO_FULL \
                                 | HAL_FDCAN_FLAG_TX_EVT_FIFO_NEW_DATA) /*!< Define the Tx event FIFO IT related mask */
#define FDCAN_RX_FIFO_0_MSK (HAL_FDCAN_FLAG_RX_FIFO_0_MSG_LOST | HAL_FDCAN_FLAG_RX_FIFO_0_FULL \
                             | HAL_FDCAN_FLAG_RX_FIFO_0_NEW_MSG) /*!< Define the Rx FIFO 0 IT related mask     */
#define FDCAN_RX_FIFO_1_MSK (HAL_FDCAN_FLAG_RX_FIFO_1_MSG_LOST | HAL_FDCAN_FLAG_RX_FIFO_1_FULL \
                             | HAL_FDCAN_FLAG_RX_FIFO_1_NEW_MSG) /*!< Define the Rx FIFO 1 IT related mask     */


#define FDCAN_RAM_FLS_NBR  (28U) /*!< Max. filter List Standard number  */
#define FDCAN_RAM_FLE_NBR  (8U)  /*!< Max. filter List Extended number  */
#define FDCAN_RAM_RF0_NBR  (3U)  /*!< Rx FIFO 0 elements number         */
#define FDCAN_RAM_RF1_NBR  (3U)  /*!< Rx FIFO 1 elements number         */
#define FDCAN_RAM_TEF_NBR  (3U)  /*!< Tx event FIFO elements number     */
#define FDCAN_RAM_TFQ_NBR  (3U)  /*!< Tx FIFO/Queue elements number     */

#define FDCAN_RAM_FLS_SIZE (4U)  /*!< Filter Standard element size in bytes */
#define FDCAN_RAM_FLE_SIZE (8U)  /*!< Filter Extended element size in bytes */
#define FDCAN_RAM_RF0_SIZE (72U) /*!< Rx FIFO 0 elements size in bytes      */
#define FDCAN_RAM_RF1_SIZE (72U) /*!< Rx FIFO 1 elements size in bytes      */
#define FDCAN_RAM_TEF_SIZE (8U)  /*!< Tx event FIFO elements size in bytes  */
#define FDCAN_RAM_TFQ_SIZE (72U) /*!< Tx FIFO/Queue elements size in bytes  */

#define FDCAN_RAM_FLSSA (0U)                                                           /*!< Filter List Standard Start Address */
#define FDCAN_RAM_FLESA ((FDCAN_RAM_FLSSA + (FDCAN_RAM_FLS_NBR * FDCAN_RAM_FLS_SIZE))) /*!< Filter List Extended Start Address */
#define FDCAN_RAM_RF0SA ((FDCAN_RAM_FLESA + (FDCAN_RAM_FLE_NBR * FDCAN_RAM_FLE_SIZE))) /*!< Rx FIFO 0 Start Address            */
#define FDCAN_RAM_RF1SA ((FDCAN_RAM_RF0SA + (FDCAN_RAM_RF0_NBR * FDCAN_RAM_RF0_SIZE))) /*!< Rx FIFO 1 Start Address            */
#define FDCAN_RAM_TEFSA ((FDCAN_RAM_RF1SA + (FDCAN_RAM_RF1_NBR * FDCAN_RAM_RF1_SIZE))) /*!< Tx event FIFO Start Address        */
#define FDCAN_RAM_TFQSA ((FDCAN_RAM_TEFSA + (FDCAN_RAM_TEF_NBR * FDCAN_RAM_TEF_SIZE))) /*!< Tx FIFO/Queue Start Address        */
#define FDCAN_RAM_SIZE  ((FDCAN_RAM_TFQSA + (FDCAN_RAM_TFQ_NBR * FDCAN_RAM_TFQ_SIZE))) /*!< Message RAM size                   */

#define FDCAN_STD_FILTER_TYPE_POS   (30U)                                      /*!< Position of the Standard filter type field          */
#define FDCAN_STD_FILTER_TYPE_MSK   (0x3UL << FDCAN_STD_FILTER_TYPE_POS)       /*!< Standard filter type mask field                     */

#define FDCAN_STD_FILTER_CONFIG_POS (27U)                                      /*!< Position of the Standard filter configuration field */
#define FDCAN_STD_FILTER_CONFIG_MSK (0x7UL << FDCAN_STD_FILTER_CONFIG_POS)     /*!< Standard filter config mask field                   */

#define FDCAN_STD_FILTER_ID1_POS    (16U)                                      /*!< Position of the Standard ID1 field                  */
#define FDCAN_STD_FILTER_ID1_MSK    (0x7FFUL << FDCAN_STD_FILTER_ID1_POS)      /*!< Standard filter ID1 mask field                      */

#define FDCAN_STD_FILTER_ID2_POS    (0U)                                       /*!< Position of the Standard ID2 field                  */
#define FDCAN_STD_FILTER_ID2_MSK    (0x7FFUL << FDCAN_STD_FILTER_ID2_POS)      /*!< Standard filter ID2 mask field                      */

#define FDCAN_EXT_FILTER_CONFIG_POS (29U)                                      /*!< Position of the Extended filter configuration field */
#define FDCAN_EXT_FILTER_CONFIG_MSK (0x7UL << FDCAN_EXT_FILTER_CONFIG_POS)     /*!< Extended filter config mask field                   */

