MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
#define FDCAN_EXT_FILTER_TYPE_POS   (30U)                                      /*!< Position of the Extended filter type field          */
#define FDCAN_EXT_FILTER_TYPE_MSK   (0x3UL << FDCAN_EXT_FILTER_TYPE_POS)       /*!< Extended filter type mask field                     */

#define FDCAN_EXT_FILTER_ID1_POS    (0U)                                       /*!< Position of the Extended ID1 field                  */
#define FDCAN_EXT_FILTER_ID1_MSK    (0x1FFFFFFFUL << FDCAN_EXT_FILTER_ID1_POS) /*!< Extended filter ID1 mask field                      */

#define FDCAN_EXT_FILTER_ID2_POS    (0U)                                       /*!< Position of the Extended ID2 field                  */
#define FDCAN_EXT_FILTER_ID2_MSK    (0x1FFFFFFFUL << FDCAN_EXT_FILTER_ID2_POS) /*!< Extended filter ID2 mask field                      */

#define FDCAN_STD_FILTER_ID_POS     (18U)                                      /*!< ID standard filter position in Tx/Rx/event header   */

#define HAL_FDCAN_IT_GROUP_MSK (HAL_FDCAN_IT_GROUP_RX_FIFO_0        \
                                | HAL_FDCAN_IT_GROUP_RX_FIFO_1      \
                                | HAL_FDCAN_IT_GROUP_STATUS_MSG     \
                                | HAL_FDCAN_IT_GROUP_TX_FIFO_ERROR  \
                                | HAL_FDCAN_IT_GROUP_MISC           \
                                | HAL_FDCAN_IT_GROUP_BIT_LINE_ERROR \
                                | HAL_FDCAN_IT_GROUP_PROTOCOL_ERROR)  /*!< Interrupts group mask */

/**
  * @brief Minimum and maximum values for FDCAN nominal bit timing parameters.
  */
#define FDCAN_NOMINAL_PRES_MIN  (1U)    /*!< Minimum nominal prescaler value      */
#define FDCAN_NOMINAL_PRES_MAX  (512U)  /*!< Maximum nominal prescaler value      */
#define FDCAN_NOMINAL_SJW_MIN   (1U)    /*!< Minimum nominal SJW value            */
#define FDCAN_NOMINAL_SJW_MAX   (128U)  /*!< Maximum nominal SJW value            */
#define FDCAN_NOMINAL_TSEG1_MIN (1U)    /*!< Minimum nominal time segment 1 value */
#define FDCAN_NOMINAL_TSEG1_MAX (256U)  /*!< Maximum nominal time segment 1 value */
#define FDCAN_NOMINAL_TSEG2_MIN (1U)    /*!< Minimum nominal time segment 2 value */
#define FDCAN_NOMINAL_TSEG2_MAX (128U)  /*!< Maximum nominal time segment 2 value */

/**
  * @brief Minimum and maximum values for FDCAN data bit timing parameters.
  */
#define FDCAN_DATA_PRES_MIN     (1U)    /*!< Minimum data prescaler value      */
#define FDCAN_DATA_PRES_MAX     (32U)   /*!< Maximum data prescaler value      */
#define FDCAN_DATA_SJW_MIN      (1U)    /*!< Minimum data SJW value            */
#define FDCAN_DATA_SJW_MAX      (16U)   /*!< Maximum data SJW value            */
#define FDCAN_DATA_TSEG1_MIN    (1U)    /*!< Minimum data time segment 1 value */
#define FDCAN_DATA_TSEG1_MAX    (32U)   /*!< Maximum data time segment 1 value */
#define FDCAN_DATA_TSEG2_MIN    (1U)    /*!< Minimum data time segment 2 value */
#define FDCAN_DATA_TSEG2_MAX    (16U)   /*!< Maximum data time segment 2 value */

/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup FDCAN_Private_Macros FDCAN Private Macros
  * @{
  */

/**
  * @brief  Get the FDCAN hardware instance from a handle.
  * @param  handle Pointer to a @ref hal_fdcan_handle_t structure.
  * @retval FDCAN_GlobalTypeDef* Pointer to the FDCAN peripheral instance.
  */
#define FDCAN_GET_INSTANCE(handle) ((FDCAN_GlobalTypeDef *)((uint32_t)(handle)->instance))

/**
  * @brief  Get the FDCAN CONFIG hardware instance from a handle.
  * @param  handle Pointer to a @ref hal_fdcan_handle_t structure.
  * @retval FDCAN_Config_TypeDef* Pointer to the FDCAN CONFIG peripheral instance.
  */
#define FDCAN_CONFIG_GET_INSTANCE(handle) FDCAN_MULTI_INSTANCE_CONFIG((FDCAN_GlobalTypeDef *) \
                                                                      (uint32_t)(handle)->instance)

/**
  * @brief  Get the FDCAN message element size in 32-bit words.
  * @param  element FDCAN data field size encoding. See @ref hal_fdcan_data_field_size_t.
  * @retval uint32_t Element size in words, including the FDCAN header words.
  */
#define FDCAN_GET_ELEMENT_SIZE_WORDS(element) ((uint32_t)(fdcan_lut_eltsize2words[(uint32_t)element]))

/**
  * @brief  Get payload size in bytes from a Data Length Code (DLC).
  * @param  data_length_code Data length code. See @ref hal_fdcan_data_length_code_t.
  * @retval uint32_t Payload length in bytes.
  */
#define FDCAN_GET_DATA_LENGTH_BYTES(data_length_code) ((uint32_t)(fdcan_lut_dlc2bytes[(uint32_t)data_length_code]))

/**
  * @brief  Check if the frame format value is valid.
  * @param  format Frame format value to check. See @ref hal_fdcan_frame_format_t.
  * @retval SET   Frame format is valid.
  * @retval RESET Frame format is invalid.
  */
#define IS_FDCAN_FRAME_FORMAT(format) (((format) == HAL_FDCAN_FRAME_FORMAT_CLASSIC_CAN)  \
                                       || ((format) == HAL_FDCAN_FRAME_FORMAT_FD_NO_BRS) \
                                       || ((format) == HAL_FDCAN_FRAME_FORMAT_FD_BRS))

/**
  * @brief  Check if the transmit pause value is valid.
  * @param  transmit Transmit pause value to check. See @ref hal_fdcan_transmit_pause_state_t.
  * @retval SET   Transmit pause value is valid.
  * @retval RESET Transmit pause value is invalid.
  */
#define IS_FDCAN_TRANSMIT_PAUSE(transmit) (((transmit) == HAL_FDCAN_TRANSMIT_PAUSE_DISABLE)   \
                                           || ((transmit) == HAL_FDCAN_TRANSMIT_PAUSE_ENABLE))

/**
  * @brief  Check if the protocol exception value is valid.
  * @param  protocol Protocol exception value to check. See @ref hal_fdcan_protocol_exception_state_t.
  * @retval SET   Protocol exception value is valid.
  * @retval RESET Protocol exception value is invalid.
  */
#define IS_FDCAN_PROTOCOL_EXCEPTION(protocol) (((protocol) == HAL_FDCAN_PROTOCOL_EXCEPTION_DISABLE)   \
                                               || ((protocol) == HAL_FDCAN_PROTOCOL_EXCEPTION_ENABLE))

/**
  * @brief  Check if the automatic retransmission value is valid.
  * @param  transmission Automatic retransmission value to check. See @ref hal_fdcan_auto_retransmission_state_t.
  * @retval SET   Automatic retransmission value is valid.
  * @retval RESET Automatic retransmission value is invalid.
  */
#define IS_FDCAN_AUTO_RETRANSMISSION(transmission) (((transmission) == HAL_FDCAN_AUTO_RETRANSMISSION_DISABLE)   \
                                                    || ((transmission) == HAL_FDCAN_AUTO_RETRANSMISSION_ENABLE))

/**
  * @brief  Check if the mode value is valid.
  * @param  mode Mode value to check. See @ref hal_fdcan_mode_t.
  * @retval SET   Mode value is valid.
  * @retval RESET Mode value is invalid.
  */
#define IS_FDCAN_MODE(mode) (((mode) == HAL_FDCAN_MODE_NORMAL)                  \
                             || ((mode) == HAL_FDCAN_MODE_RESTRICTED_OPERATION) \
                             || ((mode) == HAL_FDCAN_MODE_BUS_MONITORING)       \
                             || ((mode) == HAL_FDCAN_MODE_INTERNAL_LOOPBACK)    \
                             || ((mode) == HAL_FDCAN_MODE_EXTERNAL_LOOPBACK))

/**
  * @brief  Check if the clock divider value is valid.
  * @param  ckdiv Clock divider value to check. See @ref hal_fdcan_clock_divider_t.
  * @retval SET   Clock divider value is valid.
  * @retval RESET Clock divider value is invalid.
  */
#define IS_FDCAN_CKDIV(ckdiv) (((ckdiv) == HAL_FDCAN_CLOCK_DIV_1)     \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_2)  \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_4)  \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_6)  \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_8)  \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_10) \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_12) \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_14) \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_16) \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_18) \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_20) \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_22) \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_24) \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_26) \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_28) \
                               || ((ckdiv) == HAL_FDCAN_CLOCK_DIV_30))

/**
  * @brief  Check if the value is less than or equal to the maximum allowed value.
  * @param  value Value to check.
  * @param  max   Maximum allowed value.
  * @retval SET   Value is within the maximum limit.
  * @retval RESET Value exceeds the maximum limit.
  */
#define IS_FDCAN_MAX_VALUE(value, max) ((value) <= (max))

/**
  * @brief  Check if the value is greater than or equal to the minimum allowed value.
  * @param  value Value to check.
  * @param  min   Minimum allowed value.
  * @retval SET   Value is within the minimum limit.
  * @retval RESET Value is below the minimum limit.
  */
#define IS_FDCAN_MIN_VALUE(value, min) ((value) >= (min))

/**
  * @brief  Check if a value is within a specified [min, max] range (inclusive).
  * @param  value Value to check.
  * @param  min   Minimum allowed value.
  * @param  max   Maximum allowed value.
  * @retval SET   Value is within the specified range.
  * @retval RESET Value is outside the specified range.
  */
#define IS_FDCAN_IN_RANGE(value, min, max) (IS_FDCAN_MIN_VALUE(value, min) && IS_FDCAN_MAX_VALUE(value, max))

/**
  * @brief  Check if the nominal prescaler value is valid.
  * @param  prescaler Nominal prescaler value to check.
  * @retval SET   Prescaler value is valid.
  * @retval RESET Prescaler value is invalid.
  */
#define IS_FDCAN_NOMINAL_PRESC(prescaler) IS_FDCAN_IN_RANGE((prescaler), FDCAN_NOMINAL_PRES_MIN, FDCAN_NOMINAL_PRES_MAX)

/**
  * @brief  Check if the nominal jump width value is valid.
  * @param  sjw Nominal jump width value to check.
  * @retval SET   Jump width value is valid.
  * @retval RESET Jump width value is invalid.
  */
#define IS_FDCAN_NOMINAL_SJW(sjw)         IS_FDCAN_IN_RANGE((sjw), FDCAN_NOMINAL_SJW_MIN, FDCAN_NOMINAL_SJW_MAX)

/**
  * @brief  Check if the nominal time segment 1 value is valid.
  * @param  tseg1 Nominal time segment 1 value to check.
  * @retval SET   Time segment 1 value is valid.
  * @retval RESET Time segment 1 value is invalid.
  */
#define IS_FDCAN_NOMINAL_TSEG1(tseg1)     IS_FDCAN_IN_RANGE((tseg1), FDCAN_NOMINAL_TSEG1_MIN, FDCAN_NOMINAL_TSEG1_MAX)

/**
  * @brief  Check if the nominal time segment 2 value is valid.
  * @param  tseg2 Nominal time segment 2 value to check.
  * @retval SET   Time segment 2 value is valid.
  * @retval RESET Time segment 2 value is invalid.
  */
#define IS_FDCAN_NOMINAL_TSEG2(tseg2)     IS_FDCAN_IN_RANGE((tseg2), FDCAN_NOMINAL_TSEG2_MIN, FDCAN_NOMINAL_TSEG2_MAX)

/**
  * @brief  Check if the data prescaler value is valid.
  * @param  prescaler Data prescaler value to check.
  * @retval SET   Data prescaler value is valid.
  * @retval RESET Data prescaler value is invalid.
  */
#define IS_FDCAN_DATA_PRESC(prescaler)     IS_FDCAN_IN_RANGE((prescaler), FDCAN_DATA_PRES_MIN, FDCAN_DATA_PRES_MAX)

/**
  * @brief  Check if the data jump width value is valid.
  * @param  sjw Data jump width value to check.
  * @retval SET   Data jump width value is valid.
  * @retval RESET Data jump width value is invalid.
  */
#define IS_FDCAN_DATA_SJW(sjw)            IS_FDCAN_IN_RANGE((sjw), FDCAN_DATA_SJW_MIN, FDCAN_DATA_SJW_MAX)

/**
  * @brief  Check if the data time segment 1 value is valid.
  * @param  tseg1 Data time segment 1 value to check.
  * @retval SET   Data time segment 1 value is valid.
  * @retval RESET Data time segment 1 value is invalid.
  */
#define IS_FDCAN_DATA_TSEG1(tseg1)        IS_FDCAN_IN_RANGE((tseg1), FDCAN_DATA_TSEG1_MIN, FDCAN_DATA_TSEG1_MAX)

/**
  * @brief  Check if the data time segment 2 value is valid.
  * @param  tseg2 Data time segment 2 value to check.
  * @retval SET   Data time segment 2 value is valid.
  * @retval RESET Data time segment 2 value is invalid.
  */
#define IS_FDCAN_DATA_TSEG2(tseg2)        IS_FDCAN_IN_RANGE((tseg2), FDCAN_DATA_TSEG2_MIN, FDCAN_DATA_TSEG2_MAX)


/**
  * @brief  Check if the ID type value is valid.
  * @param  id_type ID type value to check. See @ref hal_fdcan_id_type_t.
  * @retval SET   ID type is valid.
  * @retval RESET ID type is invalid.
  */
#define IS_FDCAN_ID_TYPE(id_type) (((id_type) == HAL_FDCAN_ID_STANDARD)    \
                                   || ((id_type) == HAL_FDCAN_ID_EXTENDED))

/**
  * @brief  Check if the Tx mode value is valid.
  * @param  tx_mode Tx mode value to check. See @ref hal_fdcan_tx_mode_t.
  * @retval SET   Tx mode is valid.
  * @retval RESET Tx mode is invalid.
  */
#define IS_FDCAN_TX_MODE(tx_mode) (((tx_mode) == HAL_FDCAN_TX_MODE_FIFO)    \
                                   || ((tx_mode) == HAL_FDCAN_TX_MODE_QUEUE))

/**
  * @brief  Check if the filter configuration value is valid.
  * @param  config Filter configuration value to check. See @ref hal_fdcan_filter_config_t.
  * @retval SET   Filter configuration is valid.
  * @retval RESET Filter configuration is invalid.
  */
#define IS_FDCAN_FILTER_CFG(config) (((config) == HAL_FDCAN_FILTER_DISABLE)          \
                                     || ((config) == HAL_FDCAN_FILTER_TO_RX_FIFO_0)    \
                                     || ((config) == HAL_FDCAN_FILTER_TO_RX_FIFO_1)    \
                                     || ((config) == HAL_FDCAN_FILTER_REJECT)        \
                                     || ((config) == HAL_FDCAN_FILTER_HP)            \
                                     || ((config) == HAL_FDCAN_FILTER_TO_RX_FIFO_0_HP) \
                                     || ((config) == HAL_FDCAN_FILTER_TO_RX_FIFO_1_HP))


/**
  * @brief  Check if the Tx location list is valid.
  * @param  location Tx buffer location value to check.
  * @retval SET   Tx location is valid.
  * @retval RESET Tx location is invalid.
  */
#define IS_FDCAN_TX_LOCATION_LIST(location) IS_FDCAN_IN_RANGE((location), HAL_FDCAN_TX_BUFFER_0, \
                                                              HAL_FDCAN_TX_BUFFER_ALL)

/**
  * @brief  Check if the Rx FIFO selection is valid.
  * @param  fifo Rx FIFO selection value to check. See @ref hal_fdcan_rx_location_t.
  * @retval SET   Rx FIFO selection is valid.
  * @retval RESET Rx FIFO selection is invalid.
  */
#define IS_FDCAN_RX_FIFO(fifo) (((fifo) == HAL_FDCAN_RX_FIFO_0)    \
                                || ((fifo) == HAL_FDCAN_RX_FIFO_1))

/**
  * @brief  Check if the Rx FIFO mode value is valid.
  * @param  mode Rx FIFO mode value to check. See @ref hal_fdcan_rx_fifo_mode_t.
  * @retval SET   Rx FIFO mode is valid.
  * @retval RESET Rx FIFO mode is invalid.
  */
#define IS_FDCAN_RX_FIFO_MODE(mode) (((mode) == HAL_FDCAN_RX_FIFO_MODE_BLOCKING)     \
                                     || ((mode) == HAL_FDCAN_RX_FIFO_MODE_OVERWRITE))

/**
  * @brief  Check that the address to retrieve the filter is valid.
  * @param  address Address pointer to check.
  * @retval SET   Address is valid (not NULL).
  * @retval RESET Address is invalid (NULL).
  */
#define IS_ADDRESS_VALID(address) ((address) != NULL)

/**
  * @brief  Check if the standard filter type value is valid.
  * @param  type Standard filter type value to check. See @ref hal_fdcan_filter_type_t.
  * @retval SET   Standard filter type is valid.
  * @retval RESET Standard filter type is invalid.
  */
#define IS_FDCAN_STD_FILTER_TYPE(type) (((type) == HAL_FDCAN_FILTER_TYPE_RANGE)      \
                                        || ((type) == HAL_FDCAN_FILTER_TYPE_DUAL)    \
                                        || ((type) == HAL_FDCAN_FILTER_TYPE_CLASSIC))

/**
  * @brief  Check if the extended filter type value is valid.
  * @param  type Extended filter type value to check. See @ref hal_fdcan_filter_type_t.
  * @retval SET   Extended filter type is valid.
  * @retval RESET Extended filter type is invalid.
  */
#define IS_FDCAN_EXT_FILTER_TYPE(type) (((type) == HAL_FDCAN_FILTER_TYPE_RANGE)            \
                                        || ((type) == HAL_FDCAN_FILTER_TYPE_DUAL)          \
                                        || ((type) == HAL_FDCAN_FILTER_TYPE_CLASSIC)       \
                                        || ((type) == HAL_FDCAN_FILTER_TYPE_RANGE_NO_EIDM))

/**
  * @brief  Check if the buffer belongs to the allowed Tx complete buffers list.
  * @param  buff Buffer bitmask to check.
  * @retval SET   Buffer(s) are valid.
  * @retval RESET Buffer(s) are invalid.
  */
#define IS_FDCAN_TX_COMPLETE_BUFFERS(buff) ((((buff) & ~HAL_FDCAN_IT_TX_CPLT_BUFFER_ALL) == 0U) && ((buff) != 0U))

/**
  * @brief  Check if the buffer belongs to the allowed Tx abort buffers list.
  * @param  buff Buffer bitmask to check.
  * @retval SET   Buffer(s) are valid.
  * @retval RESET Buffer(s) are invalid.
  */
#define IS_FDCAN_TX_ABORT_BUFFERS(buff) ((((buff) & ~HAL_FDCAN_IT_TX_ABORT_BUFFER_ALL) == 0U) && ((buff) != 0U))

/**
  * @brief  Check if the interrupt line value is valid.
  * @param  it_line Interrupt line value to check.
  * @retval SET   Interrupt line is valid.
  * @retval RESET Interrupt line is invalid.
  */
#define IS_FDCAN_IT_LINE(it_line) ((((it_line) & ~(HAL_FDCAN_IT_LINE_0 | HAL_FDCAN_IT_LINE_1)) == 0U) \
                                   && ((it_line) != 0U))

/**
  * @brief  Check if only a single bit is set in the value.
  * @param  value Value to check.
  * @retval SET   Only a single bit is set.
  * @retval RESET Zero or multiple bits are set.
  */
#define IS_FDCAN_SINGLE_BIT_SET(value) (((value) > 0U) && (((value) & ((value) - 1U)) == 0U))

/**
  * @brief  Check if the interrupt list is valid.
  * @param  it Interrupt bitmask to check.
  * @retval SET   Interrupt list is valid.
  * @retval RESET Interrupt list is invalid.
  */
#define IS_FDCAN_IT(it) (((it) != 0U) &&  (((it) & (FDCAN_IR_MSK)) != 0U))

/**
  * @brief  Check if the interrupt group is valid.
  * @param  group Interrupt group bitmask to check.
  * @retval SET   Interrupt group is valid.
  * @retval RESET Interrupt group is invalid.
  */
#define IS_FDCAN_IT_GROUP(group) (((group) & ~HAL_FDCAN_IT_GROUP_MSK) == 0U)

/**
  * @brief  Check if the non-matching frame destination is valid.
  * @param  destination Non-matching frame destination value. See @ref hal_fdcan_non_matching_acceptance_rules_t.
  * @retval SET   Destination is valid.
  * @retval RESET Destination is invalid.
  */
#define IS_FDCAN_NON_MATCHING(destination) (((destination) == HAL_FDCAN_NO_MATCH_TO_RX_FIFO_0)    \
                                            || ((destination) == HAL_FDCAN_NO_MATCH_TO_RX_FIFO_1) \
                                            || ((destination) == HAL_FDCAN_NO_MATCH_REJECT))

/**
  * @brief  Check if the reject remote mode value is valid.
  * @param  destination Reject remote mode value to check. See @ref hal_fdcan_remote_acceptance_frame_t.
  * @retval SET   Reject remote mode is valid.
  * @retval RESET Reject remote mode is invalid.
  */
#define IS_FDCAN_REJECT_REMOTE(destination) (((destination) == HAL_FDCAN_REMOTE_ACCEPT)    \
                                             || ((destination) == HAL_FDCAN_REMOTE_REJECT))

/**
  * @brief  Check if the timestamp source value is valid.
  * @param  operation Timestamp source value to check. See @ref hal_fdcan_timestamp_source_t.
  * @retval SET   Timestamp source is valid.
  * @retval RESET Timestamp source is invalid.
  */
#define IS_FDCAN_TIMESTAMP_SOURCE(operation) (((operation) == HAL_FDCAN_TIMESTAMP_SOURCE_INTERNAL)    \
                                              || ((operation) == HAL_FDCAN_TIMESTAMP_SOURCE_ZERO)     \
                                              || ((operation) == HAL_FDCAN_TIMESTAMP_SOURCE_EXTERNAL))

/**
  * @brief  Check if the timestamp prescaler value is valid.
  * @param  prescaler Timestamp prescaler value to check. See @ref hal_fdcan_timestamp_prescaler_t.
  * @retval SET   Timestamp prescaler is valid.
  * @retval RESET Timestamp prescaler is invalid.
  */
#define IS_FDCAN_TIMESTAMP_PRESCALER(prescaler) (((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_1)     \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_2)  \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_3)  \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_4)  \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_5)  \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_6)  \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_7)  \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_8)  \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_9)  \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_10) \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_11) \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_12) \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_13) \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_14) \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_15) \
                                                 || ((prescaler) == HAL_FDCAN_TIMESTAMP_PRESC_16))

/**
  * @brief  Check if the timeout operation value is valid.
  * @param  operation Timeout operation value to check. See @ref hal_fdcan_timeout_operation_t.
  * @retval SET   Timeout operation is valid.
  * @retval RESET Timeout operation is invalid.
  */
#define IS_FDCAN_TIMEOUT(operation) (((operation) == HAL_FDCAN_TIMEOUT_CONTINUOUS)       \
                                     || ((operation) == HAL_FDCAN_TIMEOUT_TX_EVENT_FIFO) \
                                     || ((operation) == HAL_FDCAN_TIMEOUT_RX_FIFO_0)     \
                                     || ((operation) == HAL_FDCAN_TIMEOUT_RX_FIFO_1))

/**
  * @}
  */

/* Private function prototypes ---------------------------------------------------------------------------------------*/
/** @defgroup FDCAN_Private_Functions FDCAN Private Functions
  * @{
  */

