MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
/* Private function to set the FDCAN nominal bit timing */
static void FDCAN_SetNominalBitTiming(FDCAN_GlobalTypeDef *fdcan, const hal_fdcan_nominal_bit_timing_t *p_timing);
/* Private function to retrieve the FDCAN nominal bit timing */
static void FDCAN_GetNominalBitTiming(const FDCAN_GlobalTypeDef *fdcan, hal_fdcan_nominal_bit_timing_t *p_timing);
/* Private function to set the FDCAN data bit timing */
static void FDCAN_SetDataBitTiming(FDCAN_GlobalTypeDef *fdcan, const hal_fdcan_data_bit_timing_t *p_timing);
/* Private function to retrieve the FDCAN data bit timing */
static void FDCAN_GetDataBitTiming(const FDCAN_GlobalTypeDef *fdcan, hal_fdcan_data_bit_timing_t *p_timing);

/* Private function to  calculate each RAM block start address and size */
static void FDCAN_ComputeRAMBlockAddresses(hal_fdcan_handle_t *hfdcan, const hal_fdcan_config_t *p_config);

/* Private function to get the message RAM configurations */
static void FDCAN_GetMessageRAMConfig(const FDCAN_GlobalTypeDef *p_fdcan, hal_fdcan_config_t *p_config);

/* Private function to copy Tx message to the message RAM */
static void FDCAN_CopyMessageToRAM(const hal_fdcan_handle_t *hfdcan,
                                   const hal_fdcan_tx_header_t *p_tx_element_header,
                                   const uint8_t *p_tx_data, uint32_t tx_buffer_idx);

/* Private function to retrieve the fdcan operation mode */
static hal_fdcan_mode_t FDCAN_GetMode(const uint32_t register_value);

/* Private function to handle flags during polling */
static hal_status_t FDCAN_WaitOnFlagUntilTimeout(const FDCAN_GlobalTypeDef *fdcan, uint32_t flag, uint32_t status,
                                                 uint32_t timeout_ms);

/* Private function to handle clock stop request */
static hal_status_t FDCAN_ResetClockStopRequest(FDCAN_GlobalTypeDef *fdcan);

/* Private function to handle initialization request */
static hal_status_t FDCAN_InitRequest(FDCAN_GlobalTypeDef *fdcan);

/* Private function to handles and dispatches FDCAN interrupt flags for a given driver instance */
static void FDCAN_HandleInterruptFlags(hal_fdcan_handle_t *hfdcan, uint32_t it_flags);

/* Private function to returns interrupt flags associated with a specific interrupt line */
static uint32_t FDCAN_GetLineSpecificInterruptFlags(const FDCAN_GlobalTypeDef *p_fdcanx, uint32_t it_line);
/**
  * @}
  */

/* Private types -----------------------------------------------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup FDCAN_Exported_Functions HAL FDCAN Functions
  * @{
  */

/** @addtogroup FDCAN_Exported_Functions_Group1
  * @{
A set of functions allowing to initialize and deinitialize the FDCAN peripheral:
    - HAL_FDCAN_Init()    : Initialize the selected device with the FDCAN instance.
    - HAL_FDCAN_DeInit()  : Restore the default configuration of the selected FDCAN peripheral.
  */

/**
  * @brief  Initializes the FDCAN peripheral according to the associated handle.
  * @param  hfdcan   Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  instance HAL FDCAN instance.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM hfdcan is NULL.
  * @retval HAL_ERROR         HAL FDCAN semaphore creation has failed (USE_HAL_MUTEX is set to 1).
  */
hal_status_t HAL_FDCAN_Init(hal_fdcan_handle_t *hfdcan, hal_fdcan_t instance)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hfdcan == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_FDCAN_ALL_INSTANCE((FDCAN_GlobalTypeDef *)((uint32_t)instance)));

  hfdcan->instance = instance;

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1)
  hfdcan->p_tx_event_fifo_cb         = HAL_FDCAN_TxEventFifoCallback;             /* TxEventFifoCallback              */
  hfdcan->p_rx_fifo_0_cb             = HAL_FDCAN_RxFifo0Callback;                 /* RxFifo0Callback                  */
  hfdcan->p_rx_fifo_1_cb             = HAL_FDCAN_RxFifo1Callback;                 /* RxFifo1Callback                  */
  hfdcan->p_tx_fifo_empty_cb         = HAL_FDCAN_TxFifoEmptyCallback;             /* TxFifoEmptyCallback              */
  hfdcan->p_tx_buffer_complete_cb    = HAL_FDCAN_TxBufferCompleteCallback;        /* TxBufferCompleteCallback         */
  hfdcan->p_tx_buffer_abort_cb       = HAL_FDCAN_TxBufferAbortCallback;           /* TxBufferAbortCallback            */
  hfdcan->p_high_priority_msg_cb     = HAL_FDCAN_HighPriorityMessageCallback;     /* HighPriorityMessageCallback      */
  hfdcan->p_ts_wraparound_cb         = HAL_FDCAN_TimestampWraparoundCallback;     /* TimestampWraparoundCallback      */
  hfdcan->p_error_cb                 = HAL_FDCAN_ErrorCallback;                   /* ErrorCallback                    */
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */

  hfdcan->latest_tx_fifo_q_request = 0U;

#if defined(USE_HAL_FDCAN_USER_DATA) && (USE_HAL_FDCAN_USER_DATA == 1)
  hfdcan->p_user_data = (void *) NULL;
#endif /* USE_HAL_FDCAN_USER_DATA */

#if defined(USE_HAL_FDCAN_GET_LAST_ERRORS) && (USE_HAL_FDCAN_GET_LAST_ERRORS == 1)
  hfdcan->last_error_codes = HAL_FDCAN_ERROR_NONE;
#endif /* USE_HAL_FDCAN_GET_LAST_ERRORS */

#if defined(USE_HAL_FDCAN_CLK_ENABLE_MODEL) && (USE_HAL_FDCAN_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  HAL_RCC_FDCAN_EnableClock();
#endif /* USE_HAL_FDCAN_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  if (HAL_OS_SemaphoreCreate(&hfdcan->semaphore) != HAL_OS_OK)
  {
    return HAL_ERROR;
  }
#endif /* USE_HAL_MUTEX */

  hfdcan->global_state = HAL_FDCAN_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  Deinitialize the FDCAN driver for the given handle and disable the peripheral.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  */
void HAL_FDCAN_DeInit(hal_fdcan_handle_t *hfdcan)
{
  FDCAN_GlobalTypeDef *p_fdcanx;

  ASSERT_DBG_PARAM((hfdcan != NULL));

