MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  ASSERT_DBG_PARAM(IS_FDCAN_ALL_INSTANCE(FDCAN_GET_INSTANCE(hfdcan)));

  /* Disable interrupt lines */
  STM32_CLEAR_BIT(p_fdcanx->ILE, (HAL_FDCAN_IT_LINE_0 | HAL_FDCAN_IT_LINE_1));

  /* Clear all interrupts enable */
  STM32_CLEAR_BIT(p_fdcanx->IE, FDCAN_IE_MSK);

  /* Abort any pending Tx buffer */
  STM32_WRITE_REG(p_fdcanx->TXBCR, HAL_FDCAN_TX_BUFFER_ALL);

  (void)FDCAN_ResetClockStopRequest(p_fdcanx);

  /* Stop the FDCAN by entering initialization mode */
  (void)FDCAN_InitRequest(p_fdcanx);

  /* Clear all the potentially pending interrupts */
  STM32_SET_BIT(p_fdcanx->IR, FDCAN_IR_MSK);

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  (void)HAL_OS_SemaphoreDelete(&hfdcan->semaphore);
#endif /* USE_HAL_MUTEX */

  hfdcan->global_state = HAL_FDCAN_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup FDCAN_Exported_Functions_Group2
  * @{
A set of functions allowing to enter and exit sleep mode for the FDCAN peripheral:
    - HAL_FDCAN_EnterPowerDownMode(): Enter in power down (sleep mode).
    - HAL_FDCAN_ExitPowerDownMode():  Exit power down (sleep mode).
  */

/**
  * @brief  Sets the FDCAN peripheral into power down (sleep) mode.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @note   In this mode, the FDCAN peripheral stops all bus activity, disables its clock, and reduces power
  *         consumption. The FDCAN can be woken up by a dedicated wakeup event or by software.
  *         This mode is specific to the FDCAN peripheral and is not to be confused with the STM32 MCU stop or standby.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR FDCAN cannot be set in power down mode.
  */
hal_status_t HAL_FDCAN_EnterPowerDownMode(hal_fdcan_handle_t *hfdcan)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  STM32_SET_BIT(p_fdcanx->CCCR, FDCAN_CCCR_CSR);

  /* Wait until FDCAN is ready for power down */
  if (FDCAN_WaitOnFlagUntilTimeout(p_fdcanx, FDCAN_CCCR_CSA, 0U, FDCAN_GLOBAL_TIMEOUT_MS) != HAL_TIMEOUT)
  {
    hfdcan->global_state = HAL_FDCAN_STATE_POWER_DOWN;
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Exit the FDCAN peripheral power down mode (sleep mode).
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR FDCAN cannot leave the power down mode.
  */
hal_status_t HAL_FDCAN_ExitPowerDownMode(hal_fdcan_handle_t *hfdcan)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  if (FDCAN_ResetClockStopRequest(p_fdcanx) != HAL_ERROR)
  {
    /* Return to normal operation */
    STM32_CLEAR_BIT(p_fdcanx->CCCR, FDCAN_CCCR_INIT);

    hfdcan->global_state = HAL_FDCAN_STATE_ACTIVE;

    status = HAL_OK;
  }

  return status;
}

/**
  * @}
  */

/** @addtogroup FDCAN_Exported_Functions_Group3
  * @{
There are two categories of HAL configuration set of functions for the peripheral configuration:
   - Global configuration functions that set or get the overall peripheral configuration.
   - Unitary configuration functions that modify or retrieve individual configuration items.

Items that can alter other config parameters must not be handled within unitary set of functions.

   - This section provides functions allowing to:
      - HAL_FDCAN_SetConfig()                        : Configure the HAL FDCAN peripheral instance into a ready to
                                                       use state (idle) according to the user parameters.
      - HAL_FDCAN_GetConfig()                        : Get the peripheral configuration.
      - HAL_FDCAN_SetNominalBitTiming()              : Configure the nominal bit timing.
      - HAL_FDCAN_GetNominalBitTiming()              : Get the nominal bit timing configuration.
      - HAL_FDCAN_SetDataBitTiming()                 : Configure the data bit timing.
      - HAL_FDCAN_GetDataBitTiming()                 : Get the data bit timing configuration.
      - HAL_FDCAN_SetFilter()                        : Configure the FDCAN reception filter.
      - HAL_FDCAN_GetFilter()                        : Get the FDCAN reception filter configuration.
      - HAL_FDCAN_SetGlobalFilter()                  : Configure the FDCAN global filter.
      - HAL_FDCAN_GetGlobalFilter()                  : Get the FDCAN global filter configuration.
      - HAL_FDCAN_SetExtendedIdMask()                : Configure the extended ID mask.
      - HAL_FDCAN_GetExtendedIdMask()                : Get the extended ID mask configuration.
      - HAL_FDCAN_SetClockDivider()                  : Configure the clock divider.
      - HAL_FDCAN_GetClockDivider()                  : Get the clock divider configuration.
      - HAL_FDCAN_SetRxFifoOverwrite()               : Configure the Rx FIFO operation mode.
      - HAL_FDCAN_GetRxFifoOverwrite()               : Get the Rx FIFO operation mode configuration.
      - HAL_FDCAN_SetRamWatchdog()                   : Configure the RAM watchdog.
      - HAL_FDCAN_GetRamWatchdog()                   : Get the RAM watchdog value.
      - HAL_FDCAN_SetConfigTimestampCounter()        : Configure the timestamp counter.
      - HAL_FDCAN_GetConfigTimestampCounter()        : Get the timestamp counter configuration.
      - HAL_FDCAN_SetConfigTimeoutCounter()          : Configure the timeout counter.
      - HAL_FDCAN_GetConfigTimeoutCounter()          : Get the timeout counter configuration.
      - HAL_FDCAN_EnableTimeoutCounter()             : Enable the timeout counter.
      - HAL_FDCAN_DisableTimeoutCounter()            : Disable the timeout counter.
      - HAL_FDCAN_IsEnabledTimeoutCounter()          : Check if the timeout counter is enabled.
      - HAL_FDCAN_SetConfigTxDelayCompensation()     : Configure the transmitter delay compensation.
      - HAL_FDCAN_GetConfigTxDelayCompensation()     : Get the transmitter delay compensation configuration.
      - HAL_FDCAN_EnableTxDelayCompensation()        : Enable the transmitter delay compensation.
      - HAL_FDCAN_DisableTxDelayCompensation()       : Disable the transmitter delay compensation.
      - HAL_FDCAN_IsEnabledTxDelayCompensation()     : Check if the transmitter delay compensation is enabled.
      - HAL_FDCAN_EnableISOMode()                    : Enable ISO 11898-1 protocol mode.
      - HAL_FDCAN_DisableISOMode()                   : Disable ISO 11898-1 protocol mode.
      - HAL_FDCAN_IsEnabledISOMode()                 : Check if the ISO mode is enabled.
      - HAL_FDCAN_EnableEdgeFiltering()              : Enable edge filtering during bus integration.
      - HAL_FDCAN_DisableEdgeFiltering()             : Disable edge filtering during bus integration.
      - HAL_FDCAN_IsEnabledEdgeFiltering()           : Check if the edge filtering is enabled.
      - HAL_FDCAN_SetMode()                          : Configure operating mode.
      - HAL_FDCAN_GetMode()                          : Get the current operative mode configuration.
      - HAL_FDCAN_EnableRestrictedOperationMode()    : Enable the restricted operation mode.
      - HAL_FDCAN_DisableRestrictedOperationMode()   : Disable the restricted operation mode.
      - HAL_FDCAN_IsEnabledRestrictedOperationMode() : Check if the FDCAN peripheral entered restricted operation mode.
      - HAL_FDCAN_SetFrameFormat()                   : Configure the frame format.
      - HAL_FDCAN_GetFrameFormat()                   : Get the frame format configuration.
      - HAL_FDCAN_EnableAutoRetransmission()         : Enable the auto retransmission.
      - HAL_FDCAN_DisableAutoRetransmission()        : Disable the auto retransmission.
      - HAL_FDCAN_IsEnabledAutoRetransmission()      : Get the automatic retransmission state.
      - HAL_FDCAN_EnableTransmitPause()              : Enable the transmit pause.
      - HAL_FDCAN_DisableTransmitPause()             : Disable the transmit pause.
      - HAL_FDCAN_IsEnabledTransmitPause()           : Get the transmit pause state.
      - HAL_FDCAN_EnableProtocolException()          : Enable the protocol exception.
      - HAL_FDCAN_DisableProtocolException()         : Disable the protocol exception.
      - HAL_FDCAN_IsEnabledProtocolException()       : Get the protocol exception state.
      - HAL_FDCAN_SetTxMode()                        : Configure the transmission FIFO/Queue mode.
      - HAL_FDCAN_GetTxMode()                        : Get the transmission FIFO/Queue mode configuration.
      - HAL_FDCAN_GetClockFreq()                     : Get the current FDCAN kernel clock.

  @note Some configuration functions require the FDCAN peripheral to be in the IDLE state before being called.
        However, several configuration functions are allowed to be called when the peripheral is in ACTIVE or IDLE
        states, as these configurations can be applied dynamically without stopping the peripheral.
  - The following functions are allowed in ACTIVE or IDLE states include:
      - HAL_FDCAN_SetFilter()
      - HAL_FDCAN_ResetTimeoutCounter()
      - HAL_FDCAN_EnableISOMode()
      - HAL_FDCAN_DisableISOMode()
      - HAL_FDCAN_EnableEdgeFiltering()
      - HAL_FDCAN_DisableEdgeFiltering()
      - HAL_FDCAN_DisableRestrictedOperationMode()
      - HAL_FDCAN_EnableAutoRetransmission()
      - HAL_FDCAN_DisableAutoRetransmission()
      - HAL_FDCAN_EnableTransmitPause()
      - HAL_FDCAN_DisableTransmitPause()
      - HAL_FDCAN_EnableProtocolException()
      - HAL_FDCAN_DisableProtocolException()
      - HAL_FDCAN_SetFrameFormat()
 */

/**
  * @brief  Configures the FDCAN according to the user parameters.
  * @param  hfdcan   Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_config Pointer to the configuration structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_config is NULL.
  * @retval HAL_ERROR         FDCAN cannot leave the power down mode..
  */
hal_status_t HAL_FDCAN_SetConfig(hal_fdcan_handle_t *hfdcan, const hal_fdcan_config_t *p_config)
{
  FDCAN_GlobalTypeDef *p_fdcanx;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_FDCAN_FRAME_FORMAT(p_config->frame_format));
  ASSERT_DBG_PARAM(IS_FDCAN_MODE(p_config->mode));
  ASSERT_DBG_PARAM(IS_FDCAN_AUTO_RETRANSMISSION(p_config->auto_retransmission));
  ASSERT_DBG_PARAM(IS_FDCAN_TRANSMIT_PAUSE(p_config->transmit_pause));
  ASSERT_DBG_PARAM(IS_FDCAN_PROTOCOL_EXCEPTION(p_config->protocol_exception));
  ASSERT_DBG_PARAM(IS_FDCAN_NOMINAL_PRESC(p_config->nominal_bit_timing.nominal_prescaler));
  ASSERT_DBG_PARAM(IS_FDCAN_NOMINAL_SJW(p_config->nominal_bit_timing.nominal_jump_width));
  ASSERT_DBG_PARAM(IS_FDCAN_NOMINAL_TSEG1(p_config->nominal_bit_timing.nominal_time_seg1));
  ASSERT_DBG_PARAM(IS_FDCAN_NOMINAL_TSEG2(p_config->nominal_bit_timing.nominal_time_seg2));
  ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(p_config->nominal_bit_timing.nominal_jump_width,
                                      p_config->nominal_bit_timing.nominal_time_seg2));
  ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(p_config->std_filters_nbr, FDCAN_RAM_FLS_NBR));
  ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(p_config->ext_filters_nbr, FDCAN_RAM_FLE_NBR));
  ASSERT_DBG_PARAM(IS_FDCAN_TX_MODE(p_config->tx_fifo_queue_mode));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_INIT | (uint32_t)HAL_FDCAN_STATE_IDLE);

