MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  if (FDCAN_ResetClockStopRequest(p_fdcanx) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (FDCAN_InitRequest(p_fdcanx) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Request configuration change */
  STM32_SET_BIT(p_fdcanx->CCCR, FDCAN_CCCR_CCE);

  STM32_MODIFY_REG(p_fdcanx->CCCR,
                   (FDCAN_CCCR_DAR | FDCAN_CCCR_TXP | FDCAN_CCCR_PXHD
                    | FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE | FDCAN_CCCR_TEST | FDCAN_CCCR_MON | FDCAN_CCCR_ASM),
                   ((uint32_t)(p_config->auto_retransmission) | (uint32_t)(p_config->transmit_pause)
                    | (uint32_t)(p_config->protocol_exception) | ((uint32_t)(p_config->frame_format))
                    | (uint32_t)p_config->mode));

  /* Disable test mode if loop-back mode is not selected else enable it */
  if (((uint32_t)p_config->mode & FDCAN_CCCR_TEST) != FDCAN_CCCR_TEST)
  {
    STM32_CLEAR_BIT(p_fdcanx->TEST, FDCAN_TEST_LBCK);
  }
  else
  {
    STM32_SET_BIT(p_fdcanx->TEST, FDCAN_TEST_LBCK);
  }

  FDCAN_SetNominalBitTiming(p_fdcanx, &p_config->nominal_bit_timing);

  if (p_config->frame_format == HAL_FDCAN_FRAME_FORMAT_FD_BRS)
  {
    ASSERT_DBG_PARAM(IS_FDCAN_DATA_PRESC(p_config->data_bit_timing.data_prescaler));
    ASSERT_DBG_PARAM(IS_FDCAN_DATA_SJW(p_config->data_bit_timing.data_jump_width));
    ASSERT_DBG_PARAM(IS_FDCAN_DATA_TSEG1(p_config->data_bit_timing.data_time_seg1));
    ASSERT_DBG_PARAM(IS_FDCAN_DATA_TSEG2(p_config->data_bit_timing.data_time_seg2));
    FDCAN_SetDataBitTiming(p_fdcanx, &p_config->data_bit_timing);
  }

  STM32_MODIFY_REG(p_fdcanx->TXBC, FDCAN_TXBC_TFQM, (uint32_t)p_config->tx_fifo_queue_mode);

  /* Calculate each RAM block address */
  FDCAN_ComputeRAMBlockAddresses(hfdcan, p_config);

  hfdcan->global_state = HAL_FDCAN_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Get the FDCAN global configuration.
  * @param  hfdcan   Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_config Pointer to the configuration structure to be filled with current configuration.
  */
void HAL_FDCAN_GetConfig(const hal_fdcan_handle_t *hfdcan, hal_fdcan_config_t *p_config)
{
  const FDCAN_GlobalTypeDef *p_fdcanx;
  uint32_t register_value;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  register_value = STM32_READ_REG(p_fdcanx->CCCR);

  p_config->mode                = FDCAN_GetMode(register_value);
  p_config->auto_retransmission = (hal_fdcan_auto_retransmission_state_t)(uint32_t)
                                  STM32_READ_BIT(register_value, FDCAN_CCCR_DAR);
  p_config->transmit_pause      = (hal_fdcan_transmit_pause_state_t)(uint32_t)
                                  STM32_READ_BIT(register_value, FDCAN_CCCR_TXP);
  p_config->protocol_exception  = (hal_fdcan_protocol_exception_state_t)(uint32_t)
                                  STM32_READ_BIT(register_value, FDCAN_CCCR_PXHD);
  p_config->frame_format        = (hal_fdcan_frame_format_t)(uint32_t)
                                  STM32_READ_BIT(register_value, (FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE));

  FDCAN_GetMessageRAMConfig(p_fdcanx, p_config);

  p_config->tx_fifo_queue_mode = (hal_fdcan_tx_mode_t)(uint32_t)(STM32_READ_BIT(p_fdcanx->TXBC, FDCAN_TXBC_TFQM));

  FDCAN_GetNominalBitTiming(p_fdcanx, &p_config->nominal_bit_timing);

  if (p_config->frame_format == HAL_FDCAN_FRAME_FORMAT_FD_BRS)
  {
    FDCAN_GetDataBitTiming(p_fdcanx, &p_config->data_bit_timing);
  }
}

/**
  * @brief  Set the FDCAN nominal bit timing configuration.
  * @param  hfdcan               Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_nominal_bit_timing Pointer to nominal bit timing structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_nominal_bit_timing is NULL.
  */
hal_status_t HAL_FDCAN_SetNominalBitTiming(const hal_fdcan_handle_t *hfdcan,
                                           const hal_fdcan_nominal_bit_timing_t *p_nominal_bit_timing)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_nominal_bit_timing != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_nominal_bit_timing == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_FDCAN_NOMINAL_PRESC(p_nominal_bit_timing->nominal_prescaler));
  ASSERT_DBG_PARAM(IS_FDCAN_NOMINAL_SJW(p_nominal_bit_timing->nominal_jump_width));
  ASSERT_DBG_PARAM(IS_FDCAN_NOMINAL_TSEG1(p_nominal_bit_timing->nominal_time_seg1));
  ASSERT_DBG_PARAM(IS_FDCAN_NOMINAL_TSEG2(p_nominal_bit_timing->nominal_time_seg2));
  ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(p_nominal_bit_timing->nominal_jump_width,
                                      p_nominal_bit_timing->nominal_time_seg2));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  FDCAN_SetNominalBitTiming(FDCAN_GET_INSTANCE(hfdcan), p_nominal_bit_timing);

  return HAL_OK;
}

/**
  * @brief  Get the FDCAN nominal bit timing configuration.
  * @param  hfdcan               Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_nominal_bit_timing Pointer to the nominal bit timing structure to be filled with current configuration.
  */
void HAL_FDCAN_GetNominalBitTiming(const hal_fdcan_handle_t *hfdcan,
                                   hal_fdcan_nominal_bit_timing_t *p_nominal_bit_timing)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_nominal_bit_timing != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  FDCAN_GetNominalBitTiming(FDCAN_GET_INSTANCE(hfdcan), p_nominal_bit_timing);
}

/**
  * @brief  Set the FDCAN data bit timing configuration.
  * @param  hfdcan             Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_data_bit_timing  Pointer to data bit timing structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_data_bit_timing is NULL.
  */
hal_status_t HAL_FDCAN_SetDataBitTiming(const hal_fdcan_handle_t *hfdcan,
                                        const hal_fdcan_data_bit_timing_t *p_data_bit_timing)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_data_bit_timing != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data_bit_timing == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

