MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  ASSERT_DBG_PARAM(IS_FDCAN_DATA_PRESC(p_data_bit_timing->data_prescaler));
  ASSERT_DBG_PARAM(IS_FDCAN_DATA_SJW(p_data_bit_timing->data_jump_width));
  ASSERT_DBG_PARAM(IS_FDCAN_DATA_TSEG1(p_data_bit_timing->data_time_seg1));
  ASSERT_DBG_PARAM(IS_FDCAN_DATA_TSEG2(p_data_bit_timing->data_time_seg2));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  FDCAN_SetDataBitTiming(FDCAN_GET_INSTANCE(hfdcan), p_data_bit_timing);

  return HAL_OK;
}

/**
  * @brief  Get the FDCAN data bit timing configuration.
  * @param  hfdcan            Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_data_bit_timing Pointer to the data bit timing structure to be filled with current configuration.
  */
void HAL_FDCAN_GetDataBitTiming(const hal_fdcan_handle_t *hfdcan, hal_fdcan_data_bit_timing_t *p_data_bit_timing)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_data_bit_timing != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  FDCAN_GetDataBitTiming(FDCAN_GET_INSTANCE(hfdcan), p_data_bit_timing);
}

/**
  * @brief  Configure the FDCAN reception filter according to the user parameters.
  * @param  hfdcan          Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_filter_config Pointer to a filter structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_filter_config is NULL.
  */
hal_status_t HAL_FDCAN_SetFilter(const hal_fdcan_handle_t *hfdcan, const hal_fdcan_filter_t *p_filter_config)
{
  uint32_t filter_element_w1;
  uint32_t filter_element_w2;
  uint32_t *filter_address;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_filter_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  hal_fdcan_config_t ram_config;

  FDCAN_GetMessageRAMConfig(FDCAN_GET_INSTANCE(hfdcan), &ram_config);

  if ((p_filter_config == NULL)
      || ((p_filter_config->id_type == HAL_FDCAN_ID_STANDARD) && (p_filter_config->filter_index
                                                                  >= ram_config.std_filters_nbr))
      || ((p_filter_config->id_type == HAL_FDCAN_ID_EXTENDED) && (p_filter_config->filter_index
                                                                  >= ram_config.ext_filters_nbr)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  ASSERT_DBG_PARAM(IS_FDCAN_ID_TYPE(p_filter_config->id_type));
  ASSERT_DBG_PARAM(IS_FDCAN_FILTER_CFG(p_filter_config->filter_config));

  if (p_filter_config->id_type == HAL_FDCAN_ID_STANDARD)
  {
    ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(p_filter_config->filter_id1,
                                        FDCAN_STD_FILTER_ID1_MSK >> FDCAN_STD_FILTER_ID1_POS));
    ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(p_filter_config->filter_id2,
                                        FDCAN_STD_FILTER_ID2_MSK >> FDCAN_STD_FILTER_ID2_POS));
    ASSERT_DBG_PARAM(IS_FDCAN_STD_FILTER_TYPE(p_filter_config->filter_type));

    /* Build filter element */
    filter_element_w1 = ((uint32_t)(p_filter_config->filter_type)
                         | ((uint32_t)(p_filter_config->filter_config) << FDCAN_STD_FILTER_CONFIG_POS)
                         | ((p_filter_config->filter_id1) << FDCAN_STD_FILTER_ID1_POS)
                         |  p_filter_config->filter_id2);

    /* Calculate filter address */
    filter_address = (uint32_t *)(hfdcan->msg_ram.std_filter_start_addr +
                                  (p_filter_config->filter_index * FDCAN_RAM_FLS_SIZE));

    /* Write filter element to the message RAM */
    *filter_address = filter_element_w1;
  }
  else /* p_filter_config->id_type == FDCAN_EXTENDED_ID */
  {
    ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(p_filter_config->filter_id1,
                                        FDCAN_EXT_FILTER_ID1_MSK >> FDCAN_EXT_FILTER_ID1_POS));
    ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(p_filter_config->filter_id2,
                                        FDCAN_EXT_FILTER_ID2_MSK >> FDCAN_EXT_FILTER_ID2_POS));
    ASSERT_DBG_PARAM(IS_FDCAN_EXT_FILTER_TYPE(p_filter_config->filter_type));

    /* Build first word of filter element */
    filter_element_w1 = (((uint32_t)(p_filter_config->filter_config) << FDCAN_EXT_FILTER_CONFIG_POS)
                         | p_filter_config->filter_id1);

    /* Build second word of filter element */
    filter_element_w2 = ((uint32_t)(p_filter_config->filter_type) | p_filter_config->filter_id2);

    /* Calculate filter address */
    filter_address = (uint32_t *)(hfdcan->msg_ram.ext_filter_start_addr +
                                  (p_filter_config->filter_index * FDCAN_RAM_FLE_SIZE));

    /* Write filter element to the message RAM as two 32bit words */
    /* Write the first 32bit word w1 */
    *filter_address = filter_element_w1;
    /* Increment to the next word address */
    filter_address++;
    /* Write the second 32bit word w2 */
    *filter_address = filter_element_w2;
  }

  return HAL_OK;
}

/**
  * @brief  Configure the FDCAN reception filter according to the specified
  *         parameters in the @ref hal_fdcan_filter_t structure.
  * @param  hfdcan          Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_filter_config Pointer to a filter structure to be filled with current configuration.
  * @param  filter_index    Index of the filter to be set.
  * @param  id_type         Filter type, for standard or extended ID.
  */
void HAL_FDCAN_GetFilter(const hal_fdcan_handle_t *hfdcan, hal_fdcan_filter_t *p_filter_config,
                         uint32_t filter_index, hal_fdcan_id_type_t id_type)
{
  uint32_t *filter_address;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_filter_config != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_ID_TYPE(id_type));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  p_filter_config->id_type = id_type;

  if (id_type == HAL_FDCAN_ID_STANDARD)
  {
    /* Filter index must be within the range of configured filters */
    ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(filter_index + 1U,
                                        (STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->RXGFC, FDCAN_RXGFC_LSS)
                                         >> FDCAN_RXGFC_LSS_Pos)));

