MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
    /* Calculate filter address */
    filter_address = (uint32_t *)(hfdcan->msg_ram.std_filter_start_addr + (filter_index * FDCAN_RAM_FLS_SIZE));

    /* Check that the address is not 0x00000000 */
    ASSERT_DBG_PARAM(IS_ADDRESS_VALID(filter_address));

    /* Process and read the S0 word */
    /* Standard filter type SFT */
    p_filter_config->filter_type   = (hal_fdcan_filter_type_t)(uint32_t)
                                     STM32_READ_BIT((uint32_t) * filter_address, FDCAN_STD_FILTER_TYPE_MSK);
    /* Standard filter element configuration SFEC */
    p_filter_config->filter_config = (hal_fdcan_filter_config_t)(uint32_t)
                                     (STM32_READ_BIT((uint32_t) * filter_address, FDCAN_STD_FILTER_CONFIG_MSK)
                                      >> FDCAN_STD_FILTER_CONFIG_POS);
    p_filter_config->filter_index  = filter_index;
    /* Standard filter ID1 SFID1 */
    p_filter_config->filter_id1    = (STM32_READ_BIT((uint32_t) * filter_address, FDCAN_STD_FILTER_ID1_MSK)
                                      >> FDCAN_STD_FILTER_ID1_POS);
    /* Standard filter ID2 SFID2 */
    p_filter_config->filter_id2    = (STM32_READ_BIT((uint32_t) * filter_address, FDCAN_STD_FILTER_ID2_MSK)
                                      >> FDCAN_STD_FILTER_ID2_POS);
  }
  else
  {
    /* Filter index must be within the range of configured filters */
    ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(filter_index + 1U,
                                        (STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->RXGFC, FDCAN_RXGFC_LSE)
                                         >> FDCAN_RXGFC_LSE_Pos)));

    /* Calculate filter address */
    filter_address = (uint32_t *)(hfdcan->msg_ram.ext_filter_start_addr + (filter_index * FDCAN_RAM_FLE_SIZE));

    /* Check that the address is not 0x00000000 */
    ASSERT_DBG_PARAM(IS_ADDRESS_VALID(filter_address));
    /* Process the F0 word */
    /* Extended filter element configuration EFEC */
    p_filter_config->filter_config = (hal_fdcan_filter_config_t)(uint32_t)
                                     (STM32_READ_BIT(*filter_address, FDCAN_EXT_FILTER_CONFIG_MSK)
                                      >> FDCAN_EXT_FILTER_CONFIG_POS);
    /* Extended filter ID 1 EFID1 */
    p_filter_config->filter_id1    = (STM32_READ_BIT(*filter_address, FDCAN_EXT_FILTER_ID1_MSK)
                                      >> FDCAN_EXT_FILTER_ID1_POS);
    p_filter_config->filter_index  = filter_index;

    /* Read the next word - F1 word */
    filter_address++;

    /* Extended filter type EFT */
    p_filter_config->filter_type   = (hal_fdcan_filter_type_t)(uint32_t)
                                     STM32_READ_BIT(*filter_address, FDCAN_EXT_FILTER_TYPE_MSK);
    /* Extended filter ID 2 EFID2 */
    p_filter_config->filter_id2    = (STM32_READ_BIT(*filter_address, FDCAN_EXT_FILTER_ID2_MSK)
                                      >> FDCAN_EXT_FILTER_ID2_POS);
  }
}

/**
  * @brief  Configure the FDCAN global filter.
  * @param  hfdcan                 Pointer to a @ref hal_fdcan_handle_t handle structure.
  * @param  p_global_filter_config Pointer to a global filter structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_global_filter_config is NULL.
  */
hal_status_t HAL_FDCAN_SetGlobalFilter(const hal_fdcan_handle_t *hfdcan,
                                       const hal_fdcan_global_filter_config_t *p_global_filter_config)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_global_filter_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_global_filter_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_FDCAN_NON_MATCHING(p_global_filter_config->acceptance_non_matching_std));
  ASSERT_DBG_PARAM(IS_FDCAN_NON_MATCHING(p_global_filter_config->acceptance_non_matching_ext));
  ASSERT_DBG_PARAM(IS_FDCAN_REJECT_REMOTE(p_global_filter_config->acceptance_remote_std));
  ASSERT_DBG_PARAM(IS_FDCAN_REJECT_REMOTE(p_global_filter_config->acceptance_remote_ext));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  /* Set global filter */
  STM32_MODIFY_REG(FDCAN_GET_INSTANCE(hfdcan)->RXGFC,
                   (FDCAN_RXGFC_ANFS | FDCAN_RXGFC_ANFE | FDCAN_RXGFC_RRFS | FDCAN_RXGFC_RRFE),
                   (((uint32_t)(p_global_filter_config->acceptance_non_matching_std) << FDCAN_RXGFC_ANFS_Pos)
                    | ((uint32_t)(p_global_filter_config->acceptance_non_matching_ext) << FDCAN_RXGFC_ANFE_Pos)
                    | ((uint32_t)(p_global_filter_config->acceptance_remote_std) << FDCAN_RXGFC_RRFS_Pos)
                    | ((uint32_t)(p_global_filter_config->acceptance_remote_ext) << FDCAN_RXGFC_RRFE_Pos)));

  return HAL_OK;
}

/**
  * @brief  Get the FDCAN global filter.
  * @param  hfdcan                 Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_global_filter_config Pointer to a global filter structure.
  */
void HAL_FDCAN_GetGlobalFilter(const hal_fdcan_handle_t *hfdcan,
                               hal_fdcan_global_filter_config_t *p_global_filter_config)
{
  uint32_t register_value;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_global_filter_config != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  register_value = STM32_READ_REG(FDCAN_GET_INSTANCE(hfdcan)->RXGFC);

  /* Get the accept non-matching frames standard value */
  p_global_filter_config->acceptance_non_matching_std = (hal_fdcan_non_matching_acceptance_rules_t)(uint32_t)
                                                        (STM32_READ_BIT(register_value, FDCAN_RXGFC_ANFS)
                                                         >> FDCAN_RXGFC_ANFS_Pos);
  /* Get the accept non-matching frames extended value */
  p_global_filter_config->acceptance_non_matching_ext = (hal_fdcan_non_matching_acceptance_rules_t)(uint32_t)
                                                        (STM32_READ_BIT(register_value, FDCAN_RXGFC_ANFE)
                                                         >> FDCAN_RXGFC_ANFE_Pos);
  /* Get the reject remote frames standard value */
  p_global_filter_config->acceptance_remote_std       = (hal_fdcan_remote_acceptance_frame_t)(uint32_t)
                                                        (STM32_READ_BIT(register_value, FDCAN_RXGFC_RRFS)
                                                         >> FDCAN_RXGFC_RRFS_Pos);
  /* Get the reject remote frames extended */
  p_global_filter_config->acceptance_remote_ext       = (hal_fdcan_remote_acceptance_frame_t)(uint32_t)
                                                        (STM32_READ_BIT(register_value, FDCAN_RXGFC_RRFE)
                                                         >> FDCAN_RXGFC_RRFE_Pos);
}

/**
  * @brief  Set the extended ID mask value.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  mask   Value of the extended ID mask, this parameter must be a number between 0 and 0x1FFFFFFF.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_SetExtendedIdMask(const hal_fdcan_handle_t *hfdcan, uint32_t mask)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(mask, FDCAN_EXT_FILTER_ID2_MSK >> FDCAN_EXT_FILTER_ID2_POS));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  STM32_WRITE_REG(FDCAN_GET_INSTANCE(hfdcan)->XIDAM, mask);

  return HAL_OK;
}

/**
  * @brief  Get the extended ID mask value.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return uint32_t Current extended ID mask (0x00000000..0xFFFFFFFF).
  */
uint32_t HAL_FDCAN_GetExtendedIdMask(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->XIDAM, FDCAN_XIDAM_EIDM);
}

/**
  * @brief  Set the FDCAN clock divider value.
  * @param  hfdcan        Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  clock_divider Value of the FDCAN clock divider.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_SetClockDivider(const hal_fdcan_handle_t *hfdcan, hal_fdcan_clock_divider_t clock_divider)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_CKDIV(clock_divider));

  /* Only the first FDCAN instance is allowed to modify the configuration */
  ASSERT_DBG_PARAM(FDCAN_GET_INSTANCE(hfdcan) == FDCAN1);

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  /* Configure clock divider */
  STM32_WRITE_REG(FDCAN_CONFIG_GET_INSTANCE(hfdcan)->CKDIV, (uint32_t)clock_divider);

  return HAL_OK;
}

/**
  * @brief  Get the clock divider for FDCAN.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current FDCAN kernel clock divider.
  */
hal_fdcan_clock_divider_t HAL_FDCAN_GetClockDivider(const hal_fdcan_handle_t *hfdcan)
{
  /* Variable containing the result of the register FDCAN_CKDIV */
  uint32_t register_value;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  register_value = STM32_READ_BIT(FDCAN_CONFIG_GET_INSTANCE(hfdcan)->CKDIV, FDCAN_CKDIV_PDIV);

  return (hal_fdcan_clock_divider_t)register_value;
}

/**
  * @brief  Configure the Rx FIFO operation mode.
  * @param  hfdcan          Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  rx_location_idx Rx FIFO selector.
  * @param  operation_mode Operation mode.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_SetRxFifoOverwrite(const hal_fdcan_handle_t *hfdcan, hal_fdcan_rx_location_t rx_location_idx,
                                          hal_fdcan_rx_fifo_mode_t operation_mode)
{
  FDCAN_GlobalTypeDef *p_fdcanx;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_RX_FIFO(rx_location_idx));
  ASSERT_DBG_PARAM(IS_FDCAN_RX_FIFO_MODE(operation_mode));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

