MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  if (rx_location_idx == HAL_FDCAN_RX_FIFO_0)
  {
    /* Select FIFO 0 operation mode */
    STM32_MODIFY_REG(p_fdcanx->RXGFC, FDCAN_RXGFC_F0OM, ((uint32_t)operation_mode << FDCAN_RXGFC_F0OM_Pos));
  }
  else /* rx_location_idx == FDCAN_RX_FIFO_1 */
  {
    /* Select FIFO 1 operation mode */
    STM32_MODIFY_REG(p_fdcanx->RXGFC, FDCAN_RXGFC_F1OM, ((uint32_t)operation_mode << FDCAN_RXGFC_F1OM_Pos));
  }

  return HAL_OK;
}

/**
  * @brief  Get the Rx FIFO operation mode.
  * @param  hfdcan           Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  rx_location_idx  Rx FIFO selector.
  * @param  p_operation_mode Pointer to the selected Rx FIFO operation mode value.

  */
void HAL_FDCAN_GetRxFifoOverwrite(const hal_fdcan_handle_t *hfdcan, hal_fdcan_rx_location_t rx_location_idx,
                                  hal_fdcan_rx_fifo_mode_t *p_operation_mode)
{
  const FDCAN_GlobalTypeDef *p_fdcanx;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_operation_mode != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_RX_FIFO(rx_location_idx));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  if (rx_location_idx == HAL_FDCAN_RX_FIFO_0)
  {
    *p_operation_mode = (hal_fdcan_rx_fifo_mode_t)(uint32_t)(STM32_READ_BIT(p_fdcanx->RXGFC, FDCAN_RXGFC_F0OM)
                                                             >> FDCAN_RXGFC_F0OM_Pos);
  }
  else
  {
    *p_operation_mode = (hal_fdcan_rx_fifo_mode_t)(uint32_t)(STM32_READ_BIT(p_fdcanx->RXGFC, FDCAN_RXGFC_F1OM)
                                                             >> FDCAN_RXGFC_F1OM_Pos);
  }
}

/**
  * @brief   Configure the RAM watchdog.
  * @param   hfdcan              Pointer to a @ref hal_fdcan_handle_t handle.
  * @param   counter_start_value Start value of the message RAM watchdog counter,
  *          this parameter must be a number between 0x00 and 0xFF.
  * @note    With the reset value of 0x00 the counter is disabled.
  * @retval  HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_SetRamWatchdog(const hal_fdcan_handle_t *hfdcan, uint8_t counter_start_value)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);
  /* Configure the RAM watchdog counter start value */
  STM32_MODIFY_REG(FDCAN_GET_INSTANCE(hfdcan)->RWD, FDCAN_RWD_WDC, (uint32_t)counter_start_value);

  return HAL_OK;
}

/**
  * @brief  Get the current RAM watchdog counter - not the configured value.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return uint8_t Current message RAM watchdog counter value (0x00..0xFF).
  */
uint8_t HAL_FDCAN_GetRamWatchdog(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (uint8_t)(STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->RWD, FDCAN_RWD_WDV) >> FDCAN_RWD_WDV_Pos);
}

/**
  * @brief  Configure the timestamp counter.
  * @param  hfdcan             Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_timestamp_config Pointer to a timestamp configuration structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_timestamp_config is NULL.
  */
hal_status_t HAL_FDCAN_SetConfigTimestampCounter(const hal_fdcan_handle_t *hfdcan,
                                                 const hal_fdcan_timestamp_config_t *p_timestamp_config)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_timestamp_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_timestamp_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_FDCAN_TIMESTAMP_PRESCALER(p_timestamp_config->timestamp_prescaler));
  ASSERT_DBG_PARAM(IS_FDCAN_TIMESTAMP_SOURCE(p_timestamp_config->timestamp_source));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  STM32_MODIFY_REG(FDCAN_GET_INSTANCE(hfdcan)->TSCC, FDCAN_TSCC_TSS | FDCAN_TSCC_TCP,
                   ((uint32_t)p_timestamp_config->timestamp_source
                    | (uint32_t)p_timestamp_config->timestamp_prescaler));
  return HAL_OK;
}

/**
  * @brief  Get the timestamp counter configuration.
  * @param  hfdcan             Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_timestamp_config Pointer to a timestamp configuration structure.
  */
void HAL_FDCAN_GetConfigTimestampCounter(const hal_fdcan_handle_t *hfdcan,
                                         hal_fdcan_timestamp_config_t *p_timestamp_config)
{
  uint32_t register_value;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_timestamp_config != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  register_value = STM32_READ_REG(FDCAN_GET_INSTANCE(hfdcan)->TSCC);

  /* Get the timestamp select mode setting */
  p_timestamp_config->timestamp_source    = (hal_fdcan_timestamp_source_t)(uint32_t)
                                            STM32_READ_BIT(register_value, FDCAN_TSCC_TSS);

  /* Get the timestamp counter prescaler */
  p_timestamp_config->timestamp_prescaler = (hal_fdcan_timestamp_prescaler_t)(uint32_t)
                                            STM32_READ_BIT(register_value, FDCAN_TSCC_TCP);
}

/**
  * @brief  Configure the timeout counter.
  * @param  hfdcan          Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_timeout_param Pointer to a timeout configuration structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_timeout_param is NULL.
  */
hal_status_t HAL_FDCAN_SetConfigTimeoutCounter(const hal_fdcan_handle_t *hfdcan,
                                               const hal_fdcan_timeout_config_t *p_timeout_param)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_timeout_param != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_timeout_param == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_FDCAN_TIMEOUT(p_timeout_param->timeout_operation));
  ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(p_timeout_param->timeout_period, (FDCAN_TOCC_TOP >> FDCAN_TOCC_TOP_Pos)));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  /* Modify the timeout select(TOS) and timeout period (TOP) */
  STM32_MODIFY_REG(FDCAN_GET_INSTANCE(hfdcan)->TOCC, (FDCAN_TOCC_TOS | FDCAN_TOCC_TOP),
                   ((uint32_t)(p_timeout_param->timeout_operation)
                    | ((uint32_t)(p_timeout_param->timeout_period) << FDCAN_TOCC_TOP_Pos)));

  return HAL_OK;
}

/**
  * @brief  Get the timeout counter configuration.
  * @param  hfdcan          Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_timeout_param Pointer to a timeout configuration structure.
  */
void HAL_FDCAN_GetConfigTimeoutCounter(const hal_fdcan_handle_t *hfdcan, hal_fdcan_timeout_config_t *p_timeout_param)
{
  uint32_t register_value;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_timeout_param != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  register_value = STM32_READ_REG(FDCAN_GET_INSTANCE(hfdcan)->TOCC);

  p_timeout_param->timeout_operation = (hal_fdcan_timeout_operation_t)(uint32_t)
                                       STM32_READ_BIT(register_value, FDCAN_TOCC_TOS);
  p_timeout_param->timeout_period    = (STM32_READ_BIT(register_value, FDCAN_TOCC_TOP) >> FDCAN_TOCC_TOP_Pos);

