MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
}

/**
  * @brief  Enable the timeout counter.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_EnableTimeoutCounter(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->TOCC, FDCAN_TOCC_ETOC);

  return HAL_OK;
}

/**
  * @brief  Disable the timeout counter.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableTimeoutCounter(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->TOCC, FDCAN_TOCC_ETOC);

  return HAL_OK;
}

/**
  * @brief  Check timeout counter status.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current timeout counter status.
  */
hal_fdcan_timeout_counter_status_t HAL_FDCAN_IsEnabledTimeoutCounter(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (hal_fdcan_timeout_counter_status_t)
         (uint32_t)STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->TOCC, FDCAN_TOCC_ETOC);
}

/**
  * @brief  Configure the transmitter delay compensation.
  * @param  hfdcan           Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_tx_delay_param Pointer to a Tx delay compensation structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_tx_delay_param is NULL.
  */
hal_status_t HAL_FDCAN_SetConfigTxDelayCompensation(const hal_fdcan_handle_t *hfdcan,
                                                    const hal_fdcan_tx_delay_comp_config_t *p_tx_delay_param)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_tx_delay_param != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_tx_delay_param == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(p_tx_delay_param->tx_delay_comp_offset,
                                      (FDCAN_TDCR_TDCO_Msk >> FDCAN_TDCR_TDCO_Pos)));
  ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(p_tx_delay_param->tx_delay_comp_win_length,
                                      (FDCAN_TDCR_TDCF_Msk >> FDCAN_TDCR_TDCF_Pos)));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  /* Configure TDC offset and filter window */
  STM32_WRITE_REG(FDCAN_GET_INSTANCE(hfdcan)->TDCR,
                  (((p_tx_delay_param->tx_delay_comp_win_length) << FDCAN_TDCR_TDCF_Pos)
                   | ((p_tx_delay_param->tx_delay_comp_offset) << FDCAN_TDCR_TDCO_Pos)));

  return HAL_OK;
}

/**
  * @brief  Get the transmitter delay compensation offset.
  * @param  hfdcan           Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_tx_delay_param Pointer to a Tx delay compensation structure.
  */
void HAL_FDCAN_GetConfigTxDelayCompensation(const hal_fdcan_handle_t *hfdcan,
                                            hal_fdcan_tx_delay_comp_config_t *p_tx_delay_param)
{
  uint32_t register_value;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_tx_delay_param != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  register_value = STM32_READ_REG(FDCAN_GET_INSTANCE(hfdcan)->TDCR);

  /* Get TdcOffset transmitter delay compensation offset */
  p_tx_delay_param->tx_delay_comp_offset     = (STM32_READ_BIT(register_value, FDCAN_TDCR_TDCO) >> FDCAN_TDCR_TDCO_Pos);
  /* Get TdcFilter transmitter delay compensation filter window length */
  p_tx_delay_param->tx_delay_comp_win_length = (STM32_READ_BIT(register_value, FDCAN_TDCR_TDCF) >> FDCAN_TDCR_TDCF_Pos);
}

/**
  * @brief  Enable the transmitter delay compensation.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_EnableTxDelayCompensation(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->DBTP, FDCAN_DBTP_TDC);

  return HAL_OK;
}

/**
  * @brief  Disable the transmitter delay compensation.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableTxDelayCompensation(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->DBTP, FDCAN_DBTP_TDC);

  return HAL_OK;
}

/**
  * @brief  Check transmitter delay compensation status.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current transmitter delay compensation status.
  */
hal_fdcan_tx_delay_comp_status_t HAL_FDCAN_IsEnabledTxDelayCompensation(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (hal_fdcan_tx_delay_comp_status_t)(uint32_t)STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->DBTP, FDCAN_DBTP_TDC);
}

/**
  * @brief  Enable ISO 11898-1 protocol mode.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_EnableISOMode(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_NISO);

  return HAL_OK;
}

/**
  * @brief  Disable ISO 11898-1 protocol mode.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableISOMode(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_NISO);

  return HAL_OK;
}

/**
  * @brief  Check ISO 11898-1 protocol mode status.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current ISO mode status.
  */
hal_fdcan_iso_mode_status_t HAL_FDCAN_IsEnabledISOMode(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (hal_fdcan_iso_mode_status_t)(uint32_t)STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_NISO);
}

/**
  * @brief  Enable edge filtering during bus integration.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @note   Two consecutive dominant tq's are required to detect an edge for hard synchronization.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_EnableEdgeFiltering(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_EFBI);

  return HAL_OK;
}

/**
  * @brief  Disable edge filtering during bus integration.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @note   One dominant tq is required to detect an edge for hard synchronization.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableEdgeFiltering(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_EFBI);

  return HAL_OK;
}

/**
  * @brief  Check edge filtering during bus integration status.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @note   One dominant tq is required to detect an edge for hard synchronization.
  * @return Current edge filtering status.
  */
hal_fdcan_edge_filtering_status_t HAL_FDCAN_IsEnabledEdgeFiltering(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

