MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  return (hal_fdcan_edge_filtering_status_t)(uint32_t)STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_EFBI);
}

/**
  * @brief  Set the FDCAN mode.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t
  * @param  mode   Value of the mode to set.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_SetMode(const hal_fdcan_handle_t *hfdcan, hal_fdcan_mode_t mode)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_MODE(mode));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  STM32_MODIFY_REG(p_fdcanx->CCCR, FDCAN_CCCR_TEST | FDCAN_CCCR_ASM | FDCAN_CCCR_MON, (uint32_t)mode);

  /* Disable test mode if loop-back mode is not selected else enable it */
  if (((uint32_t)mode & FDCAN_CCCR_TEST) != FDCAN_CCCR_TEST)
  {
    STM32_CLEAR_BIT(p_fdcanx->TEST, FDCAN_TEST_LBCK);
  }
  else
  {
    STM32_SET_BIT(p_fdcanx->TEST, FDCAN_TEST_LBCK);
  }

  return HAL_OK;
}

/**
  * @brief  Get the FDCAN mode.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current FDCAN mode.
  */
hal_fdcan_mode_t HAL_FDCAN_GetMode(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return FDCAN_GetMode(STM32_READ_REG(FDCAN_GET_INSTANCE(hfdcan)->CCCR));
}

/**
  * @brief  Enable the restricted operation mode.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR LoopBack mode is already used and cannot be combined with restricted operation mode.
  */
hal_status_t HAL_FDCAN_EnableRestrictedOperationMode(const hal_fdcan_handle_t *hfdcan)
{
  FDCAN_GlobalTypeDef *p_fdcanx;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  /* The restricted operation mode must not be combined with the loop-back mode (internal or external) */
  if (STM32_READ_BIT(p_fdcanx->CCCR, FDCAN_CCCR_TEST) != 0U)
  {
    return HAL_ERROR;
  }

  /* When INIT and CCE set to 1 then the bit ASM can be set */
  STM32_SET_BIT(p_fdcanx->CCCR, FDCAN_CCCR_ASM);

  return HAL_OK;
}

/**
  * @brief  Disable the restricted operation mode.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableRestrictedOperationMode(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  /* When INIT and CCE set to 1 then the bit ASM can be set */
  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_ASM);

  return HAL_OK;
}

/**
  * @brief  Check the FDCAN restricted operation mode status.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current restricted operation mode status.
  */
hal_fdcan_restricted_op_mode_status_t HAL_FDCAN_IsEnabledRestrictedOperationMode(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (hal_fdcan_restricted_op_mode_status_t)
         (uint32_t)STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_ASM);
}

/**
  * @brief  Set the frame format.
  * @param  hfdcan       Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  frame_format The frame format to set.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_SetFrameFormat(const hal_fdcan_handle_t *hfdcan, hal_fdcan_frame_format_t frame_format)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_FRAME_FORMAT(frame_format));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  /* Set FDCAN frame format */
  STM32_MODIFY_REG(FDCAN_GET_INSTANCE(hfdcan)->CCCR, (FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE), (uint32_t)frame_format);

  return HAL_OK;
}

/**
  * @brief  Get the frame format.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current frame format.
  */
hal_fdcan_frame_format_t HAL_FDCAN_GetFrameFormat(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (hal_fdcan_frame_format_t)
         (uint32_t)STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, (FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE));
}

/**
  * @brief  Enable automatic retransmission of messages.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_EnableAutoRetransmission(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_DAR);

  return HAL_OK;
}

/**
  * @brief  Disable auto retransmission of messages.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableAutoRetransmission(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_DAR);

  return HAL_OK;
}

/**
  * @brief  Get automatic retransmission state.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current auto retransmission setting.
  */
hal_fdcan_auto_retransmission_state_t HAL_FDCAN_IsEnabledAutoRetransmission(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (hal_fdcan_auto_retransmission_state_t)
         (uint32_t)(STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_DAR));
}

/**
  * @brief  Enable transmit pause.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_EnableTransmitPause(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_TXP);

  return HAL_OK;
}

/**
  * @brief  Disable transmit pause.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableTransmitPause(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_TXP);

  return HAL_OK;
}

/**
  * @brief  Get the transmit pause state.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current transmit pause setting.
  */
hal_fdcan_transmit_pause_state_t HAL_FDCAN_IsEnabledTransmitPause(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (hal_fdcan_transmit_pause_state_t)(uint32_t)STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_TXP);
}

/**
  * @brief  Enable protocol exception.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_EnableProtocolException(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_PXHD);

  return HAL_OK;
}

/**
  * @brief  Disable protocol exception.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableProtocolException(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_PXHD);

  return HAL_OK;
}

/**
  * @brief  Get the protocol exception status.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current protocol exception setting.
  */
hal_fdcan_protocol_exception_state_t HAL_FDCAN_IsEnabledProtocolException(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (hal_fdcan_protocol_exception_state_t)
         (uint32_t)STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_PXHD);
}

/**
  * @brief  Set the transmission FIFO/Queue mode.
  * @param  hfdcan  Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  tx_mode Transmission mode to configure.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_SetTxMode(const hal_fdcan_handle_t *hfdcan, hal_fdcan_tx_mode_t tx_mode)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_TX_MODE(tx_mode));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE);

  STM32_MODIFY_REG(FDCAN_GET_INSTANCE(hfdcan)->TXBC, FDCAN_TXBC_TFQM, (uint32_t)tx_mode);

  return HAL_OK;
}

/**
  * @brief  Get the transmission FIFO/Queue mode configuration.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current Tx FIFO/queue mode.
  */
hal_fdcan_tx_mode_t HAL_FDCAN_GetTxMode(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

