MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  return (hal_fdcan_tx_mode_t)(uint32_t)STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->TXBC, FDCAN_TXBC_TFQM);
}


/** @brief  Return the peripheral clock frequency for FDCAN.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return uint32_t Current clock frequency(Hz) (0x00000000..0xFFFFFFFF). 0U if FDCAN is not configured or not ready.
  */
uint32_t HAL_FDCAN_GetClockFreq(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_INIT | (uint32_t)HAL_FDCAN_STATE_IDLE
                   | (uint32_t)HAL_FDCAN_STATE_ACTIVE | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  STM32_UNUSED(hfdcan);

  return HAL_RCC_FDCAN_GetKernelClkFreq();
}

/**
  * @}
  */

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1)
/** @addtogroup FDCAN_Exported_Functions_Group4
  * @{
A set of functions allowing to register custom callback handlers for specific FDCAN events:
    - HAL_FDCAN_RegisterTxEventFifoCallback()          : Register callback for Tx Event FIFO interrupts.
    - HAL_FDCAN_RegisterRxFifo0Callback()              : Register callback for Rx FIFO 0 interrupts.
    - HAL_FDCAN_RegisterRxFifo1Callback()              : Register callback for Rx FIFO 1 interrupts.
    - HAL_FDCAN_RegisterTxFifoEmptyCallback()          : Register callback for Tx FIFO empty event.
    - HAL_FDCAN_RegisterTxBufferCompleteCallback()     : Register callback for Tx buffer transmission complete.
    - HAL_FDCAN_RegisterTxBufferAbortCallback()        : Register callback for Tx buffer transmission abort complete.
    - HAL_FDCAN_RegisterHighPriorityMessageCallback()  : Register callback for high priority message reception.
    - HAL_FDCAN_RegisterTimestampWraparoundCallback()  : Register callback for timestamp wraparound event.
    - HAL_FDCAN_RegisterErrorCallback()                : Register callback for error events.

    These registration functions must be called when the FDCAN handle is in the INIT or IDLE state.
    The default callbacks are weak functions that can be overridden or replaced by these registration APIs.
  */

/**
  * @brief  Register Tx event FIFO callback to be used instead of the weak HAL_FDCAN_TxEventFifoCallback()
  *         predefined callback.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_callback Pointer to the Tx event FIFO callback function.
  * @retval HAL_OK            Registering completed successfully.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_FDCAN_RegisterTxEventFifoCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_fifo_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_INIT | (uint32_t)HAL_FDCAN_STATE_IDLE);

  hfdcan->p_tx_event_fifo_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register Rx FIFO 0 callback to be used instead of the weak HAL_FDCAN_RxFifo0Callback() predefined callback.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_callback Pointer to the Rx FIFO 0 callback function.
  * @retval HAL_OK            Registering completed successfully.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_FDCAN_RegisterRxFifo0Callback(hal_fdcan_handle_t *hfdcan, hal_fdcan_fifo_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_INIT | (uint32_t)HAL_FDCAN_STATE_IDLE);

  hfdcan->p_rx_fifo_0_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register Rx FIFO 1 callback to be used instead of the weak HAL_FDCAN_RxFifo1Callback() predefined callback.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_callback Pointer to the Rx FIFO 1 callback function.
  * @retval HAL_OK            Registering completed successfully.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_FDCAN_RegisterRxFifo1Callback(hal_fdcan_handle_t *hfdcan, hal_fdcan_fifo_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_INIT | (uint32_t)HAL_FDCAN_STATE_IDLE);

  hfdcan->p_rx_fifo_1_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register Tx FIFO empty callback to be used instead of the weak HAL_FDCAN_TxFifoEmptyCallback()
  *         predefined callback.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_callback Pointer to the Tx FIFO empty callback function.
  * @retval HAL_OK            Registering completed successfully.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_FDCAN_RegisterTxFifoEmptyCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_INIT | (uint32_t)HAL_FDCAN_STATE_IDLE);

  hfdcan->p_tx_fifo_empty_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register Tx buffer complete callback to be used instead of the weak HAL_FDCAN_TxBufferCompleteCallback()
  *         predefined callback.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_callback Pointer to the Tx buffer complete callback function.
  * @retval HAL_OK            Registering completed successfully.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_FDCAN_RegisterTxBufferCompleteCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_tx_buffer_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_INIT | (uint32_t)HAL_FDCAN_STATE_IDLE);

