MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  hfdcan->p_tx_buffer_complete_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register Tx buffer abort callback to be used instead of the weak HAL_FDCAN_TxBufferAbortCallback()
  *         predefined callback.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_callback Pointer to the Tx buffer abort callback function.
  * @retval HAL_OK            Registering completed successfully.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_FDCAN_RegisterTxBufferAbortCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_tx_buffer_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_INIT | (uint32_t)HAL_FDCAN_STATE_IDLE);

  hfdcan->p_tx_buffer_abort_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register high priority message callback to be used instead of the weak
  *         HAL_FDCAN_HighPriorityMessageCallback() predefined callback.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_callback Pointer to the high priority message callback function.
  * @retval HAL_OK            Registering completed successfully.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_FDCAN_RegisterHighPriorityMessageCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_INIT | (uint32_t)HAL_FDCAN_STATE_IDLE);

  hfdcan->p_high_priority_msg_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register timestamp wrap around callback to be used instead of the weak
  *         HAL_FDCAN_TimestampWraparoundCallback() predefined callback.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_callback Pointer to the timestamp wrap around callback function.
  * @retval HAL_OK            Registering completed successfully.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_FDCAN_RegisterTimestampWraparoundCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_INIT | (uint32_t)HAL_FDCAN_STATE_IDLE);
  hfdcan->p_ts_wraparound_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register error callback to be used instead of the weak HAL_FDCAN_ErrorCallback() predefined callback.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_callback Pointer to the FDCAN error callback function.
  * @retval HAL_OK            Registering completed successfully.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_FDCAN_RegisterErrorCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_INIT | (uint32_t)HAL_FDCAN_STATE_IDLE);

  hfdcan->p_error_cb = p_callback;

  return HAL_OK;
}

/**
  * @}
  */
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */

/** @addtogroup FDCAN_Exported_Functions_Group5
  * @{
A set of functions allowing to control the peripheral and initiate an operation on the bus:
    - HAL_FDCAN_Start()                          : Start the FDCAN module.
    - HAL_FDCAN_Stop()                           : Stop the FDCAN module.
    - HAL_FDCAN_ReqTransmitMsgFromFIFOQ()        : Add a message to the Tx FIFO/Queue and activate
                                                   the corresponding transmission request.
    - HAL_FDCAN_GetLatestTxFifoQRequestBuffer()  : Get the Tx buffer index of latest Tx FIFO/Queue request.
    - HAL_FDCAN_GetTxFifoFreeLevel()             : Get the Tx FIFO free level.
    - HAL_FDCAN_ReqAbortOfTxBuffer()             : Abort transmission request.
    - HAL_FDCAN_GetTxEvent()                     : Get a FDCAN Tx event from the Tx event FIFO zone
                                                   into the message RAM.
    - HAL_FDCAN_GetTxEventFifoFillLevel()        : Get the Tx event FIFO fill level.
    - HAL_FDCAN_GetTxBufferMessageStatus()       : Check if a transmission request is pending on any
                                                   of the selected Tx buffers.
    - HAL_FDCAN_GetReceivedMessage()             : Get a FDCAN frame from the Rx FIFO zone into the message RAM.
    - HAL_FDCAN_GetRxFifoFillLevel()             : Get the Rx FIFO fill level.
    - HAL_FDCAN_GetTimestampCounter()            : Get the timestamp counter value.
    - HAL_FDCAN_ResetTimestampCounter()          : Reset the timestamp counter to zero.
    - HAL_FDCAN_GetTimeoutCounter()              : Get the timeout counter value.
    - HAL_FDCAN_ResetTimeoutCounter()            : Reset the timeout counter to its starting value.
    - HAL_FDCAN_GetHighPriorityMessageStatus()   : Get the high priority message status.
    - HAL_FDCAN_GetProtocolStatus()              : Get the protocol status.
    - HAL_FDCAN_GetErrorCounters()               : Get the error counter values.
    - HAL_FDCAN_Recover()                        : Recover the bus-off error.
  */

/**
  * @brief  Start the FDCAN module.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM hfdcan is NULL.
  * @retval HAL_BUSY          There is ongoing process.
  */
hal_status_t HAL_FDCAN_Start(hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hfdcan == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, HAL_FDCAN_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hfdcan, global_state, HAL_FDCAN_STATE_IDLE, HAL_FDCAN_STATE_ACTIVE);

  /* Request leave initialisation */
  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->CCCR, FDCAN_CCCR_INIT);

#if defined(USE_HAL_FDCAN_GET_LAST_ERRORS) && (USE_HAL_FDCAN_GET_LAST_ERRORS == 1)
  hfdcan->last_error_codes = HAL_FDCAN_ERROR_NONE;
#endif /* USE_HAL_FDCAN_GET_LAST_ERRORS */

  return HAL_OK;
}

/**
  * @brief  Stop the FDCAN module and enable access to configuration registers.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM hfdcan is NULL.
  * @retval HAL_ERROR         FDCAN cannot leave the power down mode.
  */
hal_status_t HAL_FDCAN_Stop(hal_fdcan_handle_t *hfdcan)
{
  FDCAN_GlobalTypeDef *p_fdcanx;

  ASSERT_DBG_PARAM((hfdcan != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hfdcan == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_ACTIVE | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

