MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  if (FDCAN_ResetClockStopRequest(p_fdcanx) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* To stop the FDCAN, initialization mode is entered */
  if (FDCAN_InitRequest(p_fdcanx) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Enable configuration change */
  STM32_SET_BIT(p_fdcanx->CCCR, FDCAN_CCCR_CCE);

  /* Reset latest Tx FIFO/Queue request buffer index */
  hfdcan->latest_tx_fifo_q_request = 0U;

  hfdcan->global_state = HAL_FDCAN_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Add a message to the Tx FIFO/Queue and activate the corresponding transmission request.
  * @param  hfdcan              Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_tx_element_header Pointer to a Tx element header structure.
  * @param  p_tx_data           Pointer to a buffer containing the payload of the Tx frame.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_tx_element_header or p_tx_data are NULL.
  * @retval HAL_ERROR         The Tx FIFO/Queue is full
  */
hal_status_t HAL_FDCAN_ReqTransmitMsgFromFIFOQ(hal_fdcan_handle_t *hfdcan,
                                               const hal_fdcan_tx_header_t *p_tx_element_header,
                                               const uint8_t *p_tx_data)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  uint32_t put_index;
  hal_fdcan_tx_header_t tx_element_header;
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_tx_data != NULL));
  ASSERT_DBG_PARAM((p_tx_element_header != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_tx_element_header == NULL) || (p_tx_data == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  tx_element_header = *p_tx_element_header;

  if (tx_element_header.b.identifier_type == HAL_FDCAN_ID_STANDARD)
  {
    ASSERT_DBG_PARAM(IS_FDCAN_MAX_VALUE(tx_element_header.b.identifier,
                                        FDCAN_STD_FILTER_ID2_MSK >> FDCAN_STD_FILTER_ID2_POS));

    /* A standard identifier has to be written to ID[28:18] */
    tx_element_header.b.identifier <<= FDCAN_STD_FILTER_ID_POS;
  }

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  /* Check that the Tx FIFO/Queue is not full */
  if (STM32_READ_BIT(p_fdcanx->TXFQS, FDCAN_TXFQS_TFQF) == 0U)
  {
    /* Get the Tx FIFO put_index */
    put_index = STM32_READ_BIT(p_fdcanx->TXFQS, FDCAN_TXFQS_TFQPI) >> FDCAN_TXFQS_TFQPI_Pos;

    /* Add the message to the Tx FIFO/Queue */
    FDCAN_CopyMessageToRAM(hfdcan, &tx_element_header, p_tx_data, put_index);

    /* Activate the corresponding transmission request */
    STM32_WRITE_REG(p_fdcanx->TXBAR, 1UL << put_index);

    /* Store the latest Tx FIFO/Queue request buffer index */
    hfdcan->latest_tx_fifo_q_request = (1UL << put_index);

    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Get the Tx FIFO/Queue status.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current FIFO/Queue status.
  */
hal_fdcan_fifo_status_t HAL_FDCAN_GetTxFifoStatus(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (hal_fdcan_fifo_status_t)(uint32_t)STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->TXFQS, FDCAN_TXFQS_TFQF);
}

/**
  * @brief  Get the Tx buffer index of latest Tx FIFO/Queue request.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return uint32_t Current index of last Tx FIFO/Queue request (0x00000000..0xFFFFFFFF).
            0U if No Tx submitted request.
  */
uint32_t HAL_FDCAN_GetLatestTxFifoQRequestBuffer(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  /* Return last Tx FIFO/Queue request buffer */
  return (hfdcan->latest_tx_fifo_q_request);
}

/**
  * @brief   Return the Tx FIFO free level - number of consecutive free Tx FIFO elements starting
  *          from Tx FIFO get_index.
  * @param   hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @warning This function is relevant only when the Tx FIFO operates in FIFO mode.
  *          In Queue mode, the Tx FIFO free level is always @ref HAL_FDCAN_TX_FIFO_FREE_LEVEL_0.
  * @return  Current Tx FIFO free level.
  */
hal_fdcan_tx_fifo_free_level_t HAL_FDCAN_GetTxFifoFreeLevel(const hal_fdcan_handle_t *hfdcan)
{
  const FDCAN_GlobalTypeDef *p_fdcanx;
  hal_fdcan_tx_fifo_free_level_t fifo_free_level = HAL_FDCAN_TX_FIFO_FREE_LEVEL_0;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  if (STM32_READ_BIT(p_fdcanx->TXBC, FDCAN_TXBC_TFQM) != (uint32_t)HAL_FDCAN_TX_MODE_QUEUE)
  {
    fifo_free_level = (hal_fdcan_tx_fifo_free_level_t)(uint32_t)STM32_READ_BIT(p_fdcanx->TXFQS, FDCAN_TXFQS_TFFL);
  }

  return fifo_free_level;
}

/**
  * @brief  Abort transmission request.
  * @param  hfdcan        Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  tx_buffer_idx Transmission buffer index.
  *         This parameter can be any combination of @ref FDCAN_IT_Tx_Abort_Buffers_Select.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_ReqAbortOfTxBuffer(const hal_fdcan_handle_t *hfdcan, uint32_t tx_buffer_idx)
{
  FDCAN_GlobalTypeDef *p_fdcanx;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  ASSERT_DBG_PARAM(IS_FDCAN_TX_LOCATION_LIST(tx_buffer_idx));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_ACTIVE | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  STM32_WRITE_REG(p_fdcanx->TXBCR, tx_buffer_idx);

  return HAL_OK;
}

/**
  * @brief  Get a FDCAN Tx event from the Tx event FIFO zone into the message RAM.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_tx_event Pointer to a hal_fdcan_tx_evt_fifo_header_t structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_tx_event is NULL.
  * @retval HAL_ERROR         FIFO is empty or no RAM was allocated for it.
  */
hal_status_t HAL_FDCAN_GetTxEvent(const hal_fdcan_handle_t *hfdcan, hal_fdcan_tx_evt_fifo_header_t *p_tx_event)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  const uint32_t *tx_event_address;
  uint32_t get_index;
  uint32_t register_txefs_value;
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_tx_event != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_tx_event == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

