MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  register_txefs_value = STM32_READ_BIT(p_fdcanx->TXEFS, FDCAN_TXEFS_EFFL);
  /* Check that the Tx event FIFO is not empty */
  if (register_txefs_value != 0U)
  {
    /* Calculate Tx event FIFO element address */
    get_index = (STM32_READ_BIT(p_fdcanx->TXEFS, FDCAN_TXEFS_EFGI) >> FDCAN_TXEFS_EFGI_Pos);
    tx_event_address = (uint32_t *)(hfdcan->msg_ram.tx_event_start_addr + (get_index * FDCAN_RAM_TEF_SIZE));

    /* Build the 64-bit Tx event header */
    p_tx_event->d64 = ((uint64_t)tx_event_address[1U] << 32U) | (uint64_t)tx_event_address[0U];

    /* A standard identifier has to be written to ID[28:18] */
    if (p_tx_event->b.identifier_type == HAL_FDCAN_ID_STANDARD)
    {
      /* Shift ID */
      p_tx_event->b.identifier >>= FDCAN_STD_FILTER_ID_POS;
    }

    /* Acknowledge the Tx event FIFO that the oldest element is read so that it increments the get_index */
    STM32_WRITE_REG(p_fdcanx->TXEFA, get_index);

    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Return the number of unread Tx event FIFO elements.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_fill_level Pointer to variable to receive the current fill level.
  */
void HAL_FDCAN_GetTxEventFifoFillLevel(const hal_fdcan_handle_t *hfdcan, uint32_t *p_fill_level)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_fill_level != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  *p_fill_level = STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->TXEFS, FDCAN_TXEFS_EFFL) >> FDCAN_TXEFS_EFFL_Pos;
}

/**
  * @brief  Check if a transmission request is pending on any of the selected Tx buffers.
  * @param  hfdcan        Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  tx_buffer_idx Transmission buffer index.
  *         This parameter can be any combination of @ref FDCAN_Tx_Buffer_Location.
  * @return Current Tx buffer pending status.
  */
hal_fdcan_tx_buffer_status_t HAL_FDCAN_GetTxBufferMessageStatus(const hal_fdcan_handle_t *hfdcan,
                                                                uint32_t tx_buffer_idx)
{
  const FDCAN_GlobalTypeDef *p_fdcanx;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  ASSERT_DBG_PARAM(IS_FDCAN_TX_LOCATION_LIST(tx_buffer_idx));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return STM32_IS_BIT_SET(p_fdcanx->TXBRP, tx_buffer_idx) ? HAL_FDCAN_TX_BUFFER_PENDING
         : HAL_FDCAN_TX_BUFFER_NOT_PENDING;
}

/**
  * @brief  Get a FDCAN frame from the Rx FIFO zone into the message RAM.
  * @param  hfdcan          Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  rx_location_idx Location of received message to read.
  * @param  p_rx_header     Pointer to an Rx element header structure to be filled.
  * @param  p_rx_data       Pointer to a buffer where the payload of the Rx message has to be stored.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_rx_header or p_rx_data are NULL.
  * @retval HAL_ERROR         Rx FIFO empty.
  */
hal_status_t HAL_FDCAN_GetReceivedMessage(const hal_fdcan_handle_t *hfdcan, hal_fdcan_rx_location_t rx_location_idx,
                                          hal_fdcan_rx_header_t *p_rx_header, uint8_t *p_rx_data)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  uint32_t *rx_address;
  uint32_t byte_count;
  uint32_t get_index = 0U;
  uint32_t most_significant_word;
  uint32_t least_significant_word;
  uint8_t  *p_data;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_rx_header != NULL));
  ASSERT_DBG_PARAM((p_rx_data != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_RX_FIFO(rx_location_idx));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_rx_header == NULL) || (p_rx_data == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  /* Rx element is assigned to the Rx FIFO 0 while it is not empty */
  if ((STM32_READ_BIT(p_fdcanx->RXF0S, FDCAN_RXF0S_F0FL) != 0U) && (rx_location_idx == HAL_FDCAN_RX_FIFO_0))
  {
    /* Calculate Rx FIFO 0 element index */
    get_index = STM32_READ_BIT(p_fdcanx->RXF0S, FDCAN_RXF0S_F0GI) >> FDCAN_RXF0S_F0GI_Pos;

    /* Check if the Rx FIFO 0 is full & overwrite mode is on */
    if (STM32_READ_BIT(p_fdcanx->RXF0S, FDCAN_RXF0S_F0F) == FDCAN_RXF0S_F0F)
    {
      if (STM32_READ_BIT(p_fdcanx->RXGFC, FDCAN_RXGFC_F0OM) == FDCAN_RXGFC_F0OM)
      {
        /* When overwrite status is on discard first message in FIFO */
        /* get_index is incremented by one and wraps to 0 in case it overflows the FIFO size */
        get_index = (get_index + 1U) % FDCAN_RAM_RF0_NBR;
      }
    }
    /* Calculate Rx FIFO 0 element address */
    rx_address = (uint32_t *)(hfdcan->msg_ram.rx_fifo0_start_addr + (get_index * FDCAN_RAM_RF0_SIZE));
  }
  /* Rx element is assigned to the Rx FIFO 1 while it is not empty */
  else if (STM32_READ_BIT(p_fdcanx->RXF1S, FDCAN_RXF1S_F1FL) != 0U)
  {
    /* Calculate Rx FIFO 1 element index */
    get_index = (STM32_READ_BIT(p_fdcanx->RXF1S, FDCAN_RXF1S_F1GI) >> FDCAN_RXF1S_F1GI_Pos);

    /* Check if the Rx FIFO 1 is full & overwrite mode is on */
    if (STM32_READ_BIT(p_fdcanx->RXF1S, FDCAN_RXF1S_F1F) == FDCAN_RXF1S_F1F)
    {
      if (STM32_READ_BIT(p_fdcanx->RXGFC, FDCAN_RXGFC_F1OM) == FDCAN_RXGFC_F1OM)
      {
        /* When overwrite status is on discard first message in FIFO */
        /* get_index is incremented by one and wraps to 0 in case it overflows the FIFO size */
        get_index = (get_index + 1U) % FDCAN_RAM_RF1_NBR;
      }
    }
    /* Calculate Rx FIFO 1 element address */
    rx_address = (uint32_t *)(hfdcan->msg_ram.rx_fifo1_start_addr + (get_index * FDCAN_RAM_RF1_SIZE));
  }
  else
  {
    return HAL_ERROR;
  }

  /* Read the first word of the Rx FIFO element - R0 */
  least_significant_word = (uint32_t)(*rx_address);

  /* Increment rx_address pointer to payload of Rx FIFO element - R2....Rn */
  rx_address++;

  /* Read the second word of the Rx FIFO element - R1 */
  most_significant_word = (uint32_t)(*rx_address);

