MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  /* Build the 64-bit Tx event header */
  p_rx_header->d64 = ((uint64_t)most_significant_word << 32U) | (uint64_t)least_significant_word;

  /* A standard identifier has to be written to ID[28:18] */
  if (p_rx_header->b.identifier_type == HAL_FDCAN_ID_STANDARD)
  {
    p_rx_header->b.identifier >>= FDCAN_STD_FILTER_ID_POS;
  }

  /* Increment rx_address pointer to payload of Rx FIFO element - R2....Rn */
  rx_address++;

  /* Get Rx payload */
  p_data = (uint8_t *)rx_address;

  for (byte_count = 0; byte_count < FDCAN_GET_DATA_LENGTH_BYTES(p_rx_header->b.data_length); byte_count++)
  {
    p_rx_data[byte_count] = p_data[byte_count];
  }

  /* Rx element is assigned to the Rx FIFO 0 */
  if (rx_location_idx == HAL_FDCAN_RX_FIFO_0)
  {
    /* Acknowledge the Rx FIFO 0 that the oldest element is read so that it increments the get_index */
    STM32_WRITE_REG(p_fdcanx->RXF0A, get_index);
  }
  else /* Rx element is assigned to the Rx FIFO 1 */
  {
    /* Acknowledge the Rx FIFO 1 that the oldest element is read so that it increments the get_index */
    STM32_WRITE_REG(p_fdcanx->RXF1A, get_index);
  }

  return HAL_OK;
}

/**
  * @brief  Get the fill level of the specified Rx FIFO.
  * @param  hfdcan          Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  rx_location_idx Rx FIFO selector.
  * @param  p_fill_level Pointer to variable to receive the current fill level.
  */
void HAL_FDCAN_GetRxFifoFillLevel(const hal_fdcan_handle_t *hfdcan, hal_fdcan_rx_location_t rx_location_idx,
                                  uint32_t *p_fill_level)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_fill_level != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_RX_FIFO(rx_location_idx));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  if (rx_location_idx == HAL_FDCAN_RX_FIFO_0)
  {
    *p_fill_level = STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->RXF0S, FDCAN_RXF0S_F0FL);
  }
  else /* rx_location_idx == FDCAN_RX_FIFO_1 */
  {
    *p_fill_level = STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->RXF1S, FDCAN_RXF1S_F1FL);
  }
}


/**
  * @brief  Get the timestamp counter value.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return uint16_t Current timestamp counter value (0x0000..0xFFFF).
  */
uint16_t HAL_FDCAN_GetTimestampCounter(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return ((uint16_t)(STM32_READ_REG(FDCAN_GET_INSTANCE(hfdcan)->TSCV)));
}

/**
  * @brief  Reset the timestamp counter to zero.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Timestamp counter source is not internal.
  */
hal_status_t HAL_FDCAN_ResetTimestampCounter(const hal_fdcan_handle_t *hfdcan)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  if (STM32_READ_BIT(p_fdcanx->TSCC, FDCAN_TSCC_TSS) == (uint32_t)HAL_FDCAN_TIMESTAMP_SOURCE_INTERNAL)
  {
    STM32_CLEAR_REG(p_fdcanx->TSCV);

    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Get the timeout counter value.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return uint16_t Current timeout counter value (0x0000..0xFFFF).
  */
uint16_t HAL_FDCAN_GetTimeoutCounter(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (uint16_t)STM32_READ_BIT(FDCAN_GET_INSTANCE(hfdcan)->TOCV, FDCAN_TOCV_TOC);
}

/**
  * @brief  Reset the timeout counter to its start value.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Timeout counter source is not continuous.
  */
hal_status_t HAL_FDCAN_ResetTimeoutCounter(const hal_fdcan_handle_t *hfdcan)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  if (STM32_READ_BIT(p_fdcanx->TOCC, FDCAN_TOCC_TOS) == (uint32_t)HAL_FDCAN_TIMEOUT_CONTINUOUS)
  {
    STM32_CLEAR_REG(p_fdcanx->TOCV);

    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Get the high priority message status.
  * @param  hfdcan          Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_hp_msg_status Pointer to a high priority message status structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_hp_msg_status is NULL.
  */
hal_status_t HAL_FDCAN_GetHighPriorityMessageStatus(const hal_fdcan_handle_t *hfdcan,
                                                    hal_fdcan_high_prio_msg_status_t *p_hp_msg_status)
{
  uint32_t register_value;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_hp_msg_status != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_hp_msg_status == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  register_value = STM32_READ_REG(FDCAN_GET_INSTANCE(hfdcan)->HPMS);

  p_hp_msg_status->filter_list             = (hal_fdcan_high_prio_filter_list_t)(uint32_t)
                                             STM32_READ_BIT(register_value, FDCAN_HPMS_FLST);
  p_hp_msg_status->filter_index            = (STM32_READ_BIT(register_value, FDCAN_HPMS_FIDX) >> FDCAN_HPMS_FIDX_Pos);
  p_hp_msg_status->message_location_status = (hal_fdcan_high_prio_message_storage_t)(uint32_t)
                                             STM32_READ_BIT(register_value, FDCAN_HPMS_MSI);
  p_hp_msg_status->message_index           = STM32_READ_BIT(register_value, FDCAN_HPMS_BIDX);

  return HAL_OK;
}

/**
  * @brief  Get the protocol status.
  * @param  hfdcan            Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_protocol_status Pointer to a protocol status structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_protocol_status is NULL.
  */
hal_status_t HAL_FDCAN_GetProtocolStatus(const hal_fdcan_handle_t *hfdcan,
                                         hal_fdcan_protocol_status_t *p_protocol_status)
{
  uint32_t reg_status;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_protocol_status != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_protocol_status == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  /* Read the protocol status register */
  reg_status = STM32_READ_REG(FDCAN_GET_INSTANCE(hfdcan)->PSR);

