MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  /* Fill the protocol status structure */
  p_protocol_status->last_error_code      = (hal_fdcan_protocol_error_code_t)(uint32_t)
                                            STM32_READ_BIT(reg_status, FDCAN_PSR_LEC);
  p_protocol_status->data_last_error_code = (hal_fdcan_protocol_error_code_t)(uint32_t)
                                            (STM32_READ_BIT(reg_status, FDCAN_PSR_DLEC) >> FDCAN_PSR_DLEC_Pos);
  p_protocol_status->activity             = (hal_fdcan_communication_state_t)(uint32_t)
                                            STM32_READ_BIT(reg_status, FDCAN_PSR_ACT);
  p_protocol_status->error_status         = (hal_fdcan_protocol_error_status_t)(uint32_t)
                                            STM32_READ_BIT(reg_status, FDCAN_PSR_EP);
  p_protocol_status->error_warning        = (hal_fdcan_warning_status_t)(uint32_t)
                                            STM32_READ_BIT(reg_status, FDCAN_PSR_EW);
  p_protocol_status->bus_off              = (hal_fdcan_bus_off_status_t)(uint32_t)
                                            STM32_READ_BIT(reg_status, FDCAN_PSR_BO);
  p_protocol_status->rx_esi_flag          = (hal_fdcan_esi_flag_status_t)(uint32_t)
                                            STM32_READ_BIT(reg_status,  FDCAN_PSR_RESI);
  p_protocol_status->rx_brs_flag          = (hal_fdcan_brs_flag_status_t)(uint32_t)
                                            STM32_READ_BIT(reg_status, FDCAN_PSR_RBRS);
  p_protocol_status->rx_fdf_flag          = (hal_fdcan_edl_flag_status_t)(uint32_t)
                                            STM32_READ_BIT(reg_status, FDCAN_PSR_REDL);
  p_protocol_status->protocol_exception   = (hal_fdcan_protocol_exception_event_t)(uint32_t)
                                            STM32_READ_BIT(reg_status, FDCAN_PSR_PXE);
  p_protocol_status->tdc_value            = STM32_READ_BIT(reg_status, FDCAN_PSR_TDCV) >> FDCAN_PSR_TDCV_Pos;

  return HAL_OK;
}

/**
  * @brief  Get the error counter values.
  * @param  hfdcan           Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_error_counters Pointer to an error counters structure.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM p_error_counters is NULL.
  */
hal_status_t HAL_FDCAN_GetErrorCounters(const hal_fdcan_handle_t *hfdcan,
                                        hal_fdcan_error_counters_t *p_error_counters)
{
  uint32_t error_counter_reg;

  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM((p_error_counters != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_error_counters == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  /* Read the error counters register */
  error_counter_reg = STM32_READ_REG(FDCAN_GET_INSTANCE(hfdcan)->ECR);

  /* Fill the error counters structure */
  p_error_counters->tx_error_cnt            = STM32_READ_BIT(error_counter_reg, FDCAN_ECR_TEC) >> FDCAN_ECR_TEC_Pos;
  p_error_counters->rx_error_cnt            = STM32_READ_BIT(error_counter_reg, FDCAN_ECR_REC) >> FDCAN_ECR_REC_Pos;
  p_error_counters->rx_error_passive_status = (hal_fdcan_rx_error_passive_level_t)(uint32_t)
                                              STM32_READ_BIT(error_counter_reg, FDCAN_ECR_RP);
  p_error_counters->global_cnt              = STM32_READ_BIT(error_counter_reg, FDCAN_ECR_CEL) >> FDCAN_ECR_CEL_Pos;

  return HAL_OK;
}

/**
  * @brief  Recover the FDCAN bus-off error.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_Recover(const hal_fdcan_handle_t *hfdcan)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_ACTIVE);

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  /* If the controller is in bus-off state (FDCAN_PSR_BO set), clear the INIT bit in CCCR to start bus-off recovery.
     This allows the FDCAN to synchronize to the CAN bus and resume normal operation after the bus-off recovery
     sequence. */
  if (STM32_READ_BIT(p_fdcanx->PSR, FDCAN_PSR_BO) != (uint32_t)HAL_FDCAN_BUS_OFF_FLAG_RESET)
  {
    STM32_CLEAR_BIT(p_fdcanx->CCCR, FDCAN_CCCR_INIT);
  }

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup FDCAN_Exported_Functions_Group6
  * @{
A set of functions allowing to deal with interruptions of the peripheral:
    - HAL_FDCAN_IRQHandler()                            : FDCAN interrupt request handler.
    - HAL_FDCAN_Line0_IRQHandler()                      : FDCAN interrupt request handler for line 0 only.
    - HAL_FDCAN_Line1_IRQHandler()                      : FDCAN interrupt request handler for line 1 only.
    - HAL_FDCAN_EnableInterrupts()                      : Enable interrupt sources.
    - HAL_FDCAN_DisableInterrupts()                     : Disable interrupt sources.
    - HAL_FDCAN_IsEnabledInterrupt()                    : Check if a given interrupt source is enabled.
    - HAL_FDCAN_EnableTxBufferCompleteInterrupts()      : Enable interrupt for Tx buffer complete.
    - HAL_FDCAN_DisableTxBufferCompleteInterrupts()     : Disable interrupt for Tx buffer complete.
    - HAL_FDCAN_IsEnabledTxBufferCompleteInterrupt()    : Check if interrupt for Tx buffer complete is enabled.
    - HAL_FDCAN_EnableTxBufferCancellationInterrupts()  : Enable interrupt for Tx buffer cancellation finished.
    - HAL_FDCAN_DisableTxBufferCancellationInterrupts() : Disable interrupt for Tx buffer cancellation finished.
    - HAL_FDCAN_IsEnabledTxBufferCancellationInterrupt(): Check if interrupt for Tx buffer cancellation finished.
                                                          is enabled.
    - HAL_FDCAN_SetInterruptGroupsToLine()              : Assign interrupt groups to either interrupt line 0 or 1.
    - HAL_FDCAN_GetLineFromInterruptGroup()             : Get the line associated to an interrupt group.
    - HAL_FDCAN_EnableInterruptLines()                  : Enable the given interrupt line.
    - HAL_FDCAN_DisableInterruptLines()                 : Disable the given interrupt line.
    - HAL_FDCAN_IsEnabledInterruptLine()                : Check if a given interrupt line is enabled.

  The FDCAN interrupt handler processes events in the following order:
    - Error events (bus-off, error passive, warning, protocol errors, RAM watchdog, etc).
    - High priority message event.
    - Rx FIFO 0 events (new message, full, message lost).
    - Rx FIFO 1 events (new message, full, message lost).
    - Tx Event FIFO events (new entry, full, element lost).
    - Tx FIFO empty event.
    - Transmission complete and transmission cancellation events.
    - Timestamp wraparound event.

  The following callbacks are triggered by the FDCAN interrupt handler when the corresponding event occurs and the
  relevant interrupts are enabled.

  @note For all callbacks below, the following HAL APIs must be called as part of the initialization sequence:
    - HAL_FDCAN_EnableInterrupts()         : Enable the relevant interrupt sources (e.g., Tx, Rx, error, etc.).
    - HAL_FDCAN_SetInterruptGroupsToLine() : Map the interrupts group to an interrupt line (if required).
    - HAL_FDCAN_EnableInterruptLines()     : Enable the interrupt line(s).
    - HAL_FDCAN_Start()                    : Start the FDCAN peripheral.

The table below lists the additional, callback-specific API(s) required to trigger each callback:

   | Callback                                | Additional Required API(s) (in order)                  |
   |-----------------------------------------|--------------------------------------------------------|
   | HAL_FDCAN_TxBufferCompleteCallback()    | HAL_FDCAN_EnableTxBufferCompleteInterrupts(),          |
   |                                         | HAL_FDCAN_ReqTransmitMsgFromFIFOQ()                    |
   | HAL_FDCAN_TxBufferAbortCallback()       | HAL_FDCAN_EnableTxBufferCancellationInterrupts(),      |
   |                                         | HAL_FDCAN_ReqAbortOfTxBuffer()                         |
   | HAL_FDCAN_TxEventFifoCallback()         | HAL_FDCAN_ReqTransmitMsgFromFIFOQ()                    |
   | HAL_FDCAN_TxFifoEmptyCallback()         | HAL_FDCAN_ReqTransmitMsgFromFIFOQ()                    |
   | HAL_FDCAN_RxFifo0Callback()             | (No additional API; triggered by incoming CAN frames)  |
   | HAL_FDCAN_RxFifo1Callback()             | (No additional API; triggered by incoming CAN frames)  |
   | HAL_FDCAN_HighPriorityMessageCallback() | (No additional API; triggered by incoming CAN frames)  |
   | HAL_FDCAN_TimestampWraparoundCallback() | (No additional API; triggered by timestamp wraparound) |
   | HAL_FDCAN_ErrorCallback()               | (No additional API; triggered by any error event)      |
  @note  HAL_FDCAN_ErrorCallback is called for any error event, including bus errors, protocol errors,
         access errors, or timeouts.

  The actual callback triggered depends on the enabled interrupts and the process API in use.

  @note  Recommended interrupt group dispatching when using
         HAL_FDCAN_SetInterruptGroupsToLine() with dual-line NVIC integration:

         | Interrupt Group                   | Representative Flags  | Recommended Line | Reason                    |
         |-----------------------------------|-----------------------|------------------|---------------------------|
         | HAL_FDCAN_IT_GROUP_RX_FIFO_0      | RF0N/RF0F/RF0L        | Line 1           | Latency critical Rx path  |
         | HAL_FDCAN_IT_GROUP_RX_FIFO_1      | RF1N/RF1F/RF1L        | Line 1           | Latency critical Rx path  |
         | HAL_FDCAN_IT_GROUP_STATUS_MSG     | HPM/TC/TCF            | Line 1           | Prioritize HPM latency    |
         | HAL_FDCAN_IT_GROUP_MISC           | TSW/MRAF/TOO          | Line 1           | Prioritize MRAF handling  |
         | HAL_FDCAN_IT_GROUP_TX_FIFO_ERROR  | TFE/TEFN/TEFF/TEFL    | Line 0           | Tx service and logging    |
         | HAL_FDCAN_IT_GROUP_BIT_LINE_ERROR | ELO/EP                | Line 0           | Diagnostic                |
         | HAL_FDCAN_IT_GROUP_PROTOCOL_ERROR | EW/BO/WDI/PEA/PED/ARA | Line 0           | Diagnostic and recovery   |

  @note  NVIC does not give interrupt line 1 a higher priority than line 0 by itself.
    The effective priority remains application-defined through the NVIC configuration of
    the IRQs serving FDCANx_IT0 and FDCANx_IT1.
    When following the recommendations above, assign FDCANx_IT1 a higher NVIC priority
    than FDCANx_IT0, that is, use a lower priority value for FDCANx_IT1.

  @note  For dual-line NVIC integration, prefer HAL_FDCAN_Line0_IRQHandler() and HAL_FDCAN_Line1_IRQHandler() to get
         line-focused interrupt dispatching, clearer event attribution, and improved ISR readability.
  */

/**
  * @brief   Processes all enabled FDCAN interrupt requests (line-agnostic behavior).
  * @param   hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @warning Use HAL_FDCAN_Line0_IRQHandler() / HAL_FDCAN_Line1_IRQHandler() instead of this function when
  *          line-specific interrupt dispatching is required.
  */
void HAL_FDCAN_IRQHandler(hal_fdcan_handle_t *hfdcan)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  uint32_t it_flags;

  ASSERT_DBG_PARAM((hfdcan != NULL));

