MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  /* Retrieve all the current flags, independently of the configured line */
  it_flags = STM32_READ_REG(p_fdcanx->IR);
  it_flags &= STM32_READ_REG(p_fdcanx->IE);

  FDCAN_HandleInterruptFlags(hfdcan, it_flags);
}

/**
  * @brief  Processes only line 0 mapped and enabled FDCAN interrupt requests.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  */
void HAL_FDCAN_Line0_IRQHandler(hal_fdcan_handle_t *hfdcan)
{
  uint32_t it_flags;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  it_flags = FDCAN_GetLineSpecificInterruptFlags(FDCAN_GET_INSTANCE(hfdcan), HAL_FDCAN_IT_LINE_0);

  FDCAN_HandleInterruptFlags(hfdcan, it_flags);
}

/**
  * @brief  Processes only line 1 mapped and enabled FDCAN interrupt requests.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  */
void HAL_FDCAN_Line1_IRQHandler(hal_fdcan_handle_t *hfdcan)
{
  uint32_t it_flags;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  it_flags = FDCAN_GetLineSpecificInterruptFlags(FDCAN_GET_INSTANCE(hfdcan), HAL_FDCAN_IT_LINE_1);

  FDCAN_HandleInterruptFlags(hfdcan, it_flags);
}

/**
  * @brief  Enable the interrupts.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  interrupts Interrupt signal(s) to enable, can be OR-ed with different interrupt signals.
  *         This parameter can be any combination of @ref FDCAN_Interrupt_Sources.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_EnableInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t interrupts)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_IT(interrupts));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->IE, interrupts);

  return HAL_OK;
}

/**
  * @brief  Disable the interrupts.
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  interrupts Interrupt signal(s) to disable - can be OR-ed with other interrupt signals.
  *         This parameter can be any combination of @ref FDCAN_Interrupt_Sources.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t interrupts)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_IT(interrupts));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->IE, interrupts);

  return HAL_OK;
}

/**
  * @brief  Check the interrupt status. Apply to one single interrupt signal.
  * @param  hfdcan    Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  interrupt Interrupt signal to check. Only one single interrupt signal can be checked at a time.
  *         This parameter must be one unique sample of @ref FDCAN_Interrupt_Sources.
  * @return Current interrupt status.
  */
hal_fdcan_it_status_t HAL_FDCAN_IsEnabledInterrupt(const hal_fdcan_handle_t *hfdcan, uint32_t interrupt)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  /* Check that the IT is valid */
  ASSERT_DBG_PARAM(IS_FDCAN_IT(interrupt));
  /* Check if only one it source was passed as parameter */
  ASSERT_DBG_PARAM(IS_FDCAN_SINGLE_BIT_SET(interrupt));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (hal_fdcan_it_status_t)STM32_IS_BIT_SET(FDCAN_GET_INSTANCE(hfdcan)->IE, interrupt);
}

/**
  * @brief  Enable the transmission buffer complete interrupt.
  * @param  hfdcan         Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  tx_buffers_idx Buffers to select to enable the transmission complete interrupt - can be OR-ed.
  *         This parameter can be any combination of @ref FDCAN_IT_Tx_Complete_Buffers_Select
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_EnableTxBufferCompleteInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  /* Check the buffer selection */
  ASSERT_DBG_PARAM(IS_FDCAN_TX_COMPLETE_BUFFERS(tx_buffers_idx));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->TXBTIE, (tx_buffers_idx & HAL_FDCAN_IT_TX_CPLT_BUFFER_ALL));

  return HAL_OK;
}

/**
  * @brief  Disable the transmission buffer complete interrupt.
  * @param  hfdcan         Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  tx_buffers_idx Buffers to select to disable the transmission complete interrupt - can be OR-ed.
  *         This parameter can be any combination of @ref FDCAN_IT_Tx_Complete_Buffers_Select
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableTxBufferCompleteInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  /* Check the buffer selection */
  ASSERT_DBG_PARAM(IS_FDCAN_TX_COMPLETE_BUFFERS(tx_buffers_idx));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->TXBTIE, (tx_buffers_idx & HAL_FDCAN_IT_TX_CPLT_BUFFER_ALL));

  return HAL_OK;
}

/**
  * @brief  Check the status of the buffer connected to transmission complete interrupt.
  * @param  hfdcan        Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  tx_buffer_idx Transmission buffer index to check with transmission complete interrupt status.
  *         This is applicable to a single buffer only.
  *         This parameter must be an unique sample of @ref FDCAN_IT_Tx_Complete_Buffers_Select
  * @return Current Tx buffer transmission complete interrupt status.
  */
hal_fdcan_it_tx_buffer_complete_status_t HAL_FDCAN_IsEnabledTxBufferCompleteInterrupt(const hal_fdcan_handle_t *hfdcan,
    uint32_t tx_buffer_idx)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  /* Validate that only one buffer has to be checked */
  ASSERT_DBG_PARAM(IS_FDCAN_TX_COMPLETE_BUFFERS(tx_buffer_idx) && IS_FDCAN_SINGLE_BIT_SET(tx_buffer_idx));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

