MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  return (hal_fdcan_it_tx_buffer_complete_status_t)STM32_IS_BIT_SET(FDCAN_GET_INSTANCE(hfdcan)->TXBTIE, tx_buffer_idx);
}

/**
  * @brief  Enable the transmission cancellation finished interrupt.
  * @param  hfdcan         Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  tx_buffers_idx The buffers on which to enable the transmission cancellation finished interrupt.
  *         This parameter can be any combination of @ref FDCAN_IT_Tx_Abort_Buffers_Select
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_EnableTxBufferCancellationInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  /* Check the buffer selection */
  ASSERT_DBG_PARAM(IS_FDCAN_TX_ABORT_BUFFERS(tx_buffers_idx));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->TXBCIE, (tx_buffers_idx & HAL_FDCAN_IT_TX_ABORT_BUFFER_ALL));

  return HAL_OK;
}

/**
  * @brief  Disable the transmission cancellation finished interrupt.
  * @param  hfdcan         Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  tx_buffers_idx The buffers on which to enable the transmission cancellation finished interrupt.
  *         This parameter can be any combination of @ref FDCAN_IT_Tx_Abort_Buffers_Select
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableTxBufferCancellationInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);
  /* Check the buffer selection */
  ASSERT_DBG_PARAM(IS_FDCAN_TX_ABORT_BUFFERS(tx_buffers_idx));

  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->TXBCIE, (tx_buffers_idx & HAL_FDCAN_IT_TX_ABORT_BUFFER_ALL));

  return HAL_OK;
}

/**
  * @brief  Check the status of the buffer connected to transmission cancellation finished interrupt.
  * @param  hfdcan        Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  tx_buffer_idx Transmission buffer index to check with transmission cancellation finished status.
            This is applicable to a single buffer only.
  *         This parameter must be an unique sample of @ref FDCAN_IT_Tx_Abort_Buffers_Select
  * @return Current Tx buffer abort finished interrupt status.
  */
hal_fdcan_it_tx_buffer_abort_status_t HAL_FDCAN_IsEnabledTxBufferCancellationInterrupt(const hal_fdcan_handle_t *hfdcan,
    uint32_t tx_buffer_idx)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  /* Validate that only one buffer has to be checked */
  ASSERT_DBG_PARAM(IS_FDCAN_TX_ABORT_BUFFERS(tx_buffer_idx) && IS_FDCAN_SINGLE_BIT_SET(tx_buffer_idx));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (hal_fdcan_it_tx_buffer_abort_status_t)STM32_IS_BIT_SET(FDCAN_GET_INSTANCE(hfdcan)->TXBCIE, tx_buffer_idx);
}

/**
  * @brief  Assign the interrupt group(s) to an interrupt line.
  * @param  hfdcan            Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  interrupt_groups  Interrupt group(s) to connect to the given interrupt line.
  *         This parameter can be any combination of @ref FDCAN_Interrupt_Groups.
  * @param  it_line           Indicates which interrupt line must be assigned to the interrupt groups.
  *         This parameter must be one unique item of @ref FDCAN_Interrupt_Lines.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_SetInterruptGroupsToLine(const hal_fdcan_handle_t *hfdcan, uint32_t interrupt_groups,
                                                uint32_t it_line)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_IT_GROUP(interrupt_groups));
  ASSERT_DBG_PARAM(IS_FDCAN_IT_LINE(it_line));
  /* Check if the prequested parameter concerns only a single interrupt line */
  ASSERT_DBG_PARAM(IS_FDCAN_SINGLE_BIT_SET(it_line));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  (it_line == HAL_FDCAN_IT_LINE_0) ? STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->ILS, interrupt_groups)
  : STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->ILS, interrupt_groups);


  return HAL_OK;
}

/**
  * @brief  Get the interrupt line assigned to an interrupt group - applies to a single interrupt group.
  * @param  hfdcan           Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  interrupt_group  Interrupt group.
  *         This parameter must be one unique item of @ref FDCAN_Interrupt_Groups.
  * @retval HAL_FDCAN_IT_LINE_0 Interrupt group is assigned to line 0.
  * @retval HAL_FDCAN_IT_LINE_1 Interrupt group is assigned to line 1.
  */
uint32_t HAL_FDCAN_GetLineFromInterruptGroup(const hal_fdcan_handle_t *hfdcan, uint32_t interrupt_group)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  ASSERT_DBG_PARAM(IS_FDCAN_IT_GROUP(interrupt_group));
  /* Ensure only one interrupt group was passed as parameter */
  ASSERT_DBG_PARAM(IS_FDCAN_SINGLE_BIT_SET(interrupt_group));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  return (STM32_IS_BIT_SET(FDCAN_GET_INSTANCE(hfdcan)->ILS, interrupt_group) ? HAL_FDCAN_IT_LINE_1
          : HAL_FDCAN_IT_LINE_0);
}

/**
  * @brief  Enable the interrupt line.
  * @param  hfdcan   Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  it_lines Interrupt line(s) to enable. Can be OR-ed.
  *         This parameter can be a combination of @ref FDCAN_Interrupt_Lines.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_EnableInterruptLines(const hal_fdcan_handle_t *hfdcan, uint32_t it_lines)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  /* Check if the passed interrupt line(s) is valid */
  ASSERT_DBG_PARAM(IS_FDCAN_IT_LINE(it_lines));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

