MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  STM32_SET_BIT(FDCAN_GET_INSTANCE(hfdcan)->ILE, it_lines);

  return HAL_OK;
}

/**
  * @brief  Disable the interrupt lines.
  * @param  hfdcan   Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  it_lines Interrupt line(s) to disable.
  *         This parameter can be any combination of @ref FDCAN_Interrupt_Lines.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_FDCAN_DisableInterruptLines(const hal_fdcan_handle_t *hfdcan, uint32_t it_lines)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));
  /* Check if the passed interrupt line(s) is valid */
  ASSERT_DBG_PARAM(IS_FDCAN_IT_LINE(it_lines));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  STM32_CLEAR_BIT(FDCAN_GET_INSTANCE(hfdcan)->ILE, it_lines);

  return HAL_OK;
}

/**
  * @brief  Check the interrupt line status.
  * @param  hfdcan  Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  it_line Interrupt line to be checked.
  *         This parameter must be a unique value of @ref FDCAN_Interrupt_Lines.
  * @return Current interrupt lines status.
  */
hal_fdcan_it_lines_status_t HAL_FDCAN_IsEnabledInterruptLine(const hal_fdcan_handle_t *hfdcan, uint32_t it_line)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  ASSERT_DBG_STATE(hfdcan->global_state, (uint32_t)HAL_FDCAN_STATE_IDLE | (uint32_t)HAL_FDCAN_STATE_ACTIVE
                   | (uint32_t)HAL_FDCAN_STATE_POWER_DOWN);

  /* Check if the passed interrupt line(s) is valid */
  ASSERT_DBG_PARAM(IS_FDCAN_IT_LINE(it_line));
  /* Check if the prequested parameter concerns only a single interrupt line */
  ASSERT_DBG_PARAM(IS_FDCAN_SINGLE_BIT_SET(it_line));

  return (hal_fdcan_it_lines_status_t)STM32_IS_BIT_SET(FDCAN_GET_INSTANCE(hfdcan)->ILE, it_line);
}

/**
  * @}
  */

/** @addtogroup FDCAN_Exported_Functions_Group7
  * @{
A set of weak functions if USE_HAL_FDCAN_REGISTER_CALLBACKS is set to 0 (or custom callbacks functions if
USE_HAL_FDCAN_REGISTER_CALLBACKS is set to 1) which are used to asynchronously informed the application in non-blocking
modes:
    - HAL_FDCAN_TxEventFifoCallback()             : Transmission event FIFO callback.
    - HAL_FDCAN_RxFifo0Callback()                 : Reception FIFO 0 callback.
    - HAL_FDCAN_RxFifo1Callback()                 : Reception FIFO 1 callback.
    - HAL_FDCAN_TxFifoEmptyCallback()             : Transmission FIFO empty callback.
    - HAL_FDCAN_TxBufferCompleteCallback()        : Transmission completed callback.
    - HAL_FDCAN_TxBufferAbortCallback()           : Abort transmission callback.
    - HAL_FDCAN_HighPriorityMessageCallback()     : High priority message receiving callback.
    - HAL_FDCAN_TimestampWraparoundCallback()     : Timestamp wrap around callback.
    - HAL_FDCAN_ErrorCallback()                   : Global error callback.
  */

/**
  * @brief   Tx event callback.
  * @param   hfdcan                   Pointer to a @ref hal_fdcan_handle_t handle.
  * @param   tx_event_fifo_interrupts Indicates which Tx event FIFO interrupts are raised.
  *          This parameter can be any combination of the following values:
  *           @arg @ref HAL_FDCAN_FLAG_TX_EVT_FIFO_ELEM_LOST
  *           @arg @ref HAL_FDCAN_FLAG_TX_EVT_FIFO_FULL
  *           @arg @ref HAL_FDCAN_FLAG_TX_EVT_FIFO_NEW_DATA
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__WEAK void HAL_FDCAN_TxEventFifoCallback(hal_fdcan_handle_t *hfdcan, uint32_t tx_event_fifo_interrupts)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hfdcan);
  STM32_UNUSED(tx_event_fifo_interrupts);

  /* WARNING: This function must not be modified. When the callback is needed,
           function HAL_FDCAN_TxEventFifoCallback must be implemented in the user file.
   */
}

/**
  * @brief   Rx FIFO 0 callback.
  * @param   hfdcan              Pointer to a @ref hal_fdcan_handle_t handle.
  * @param   rx_fifo0_interrupts Indicates which Rx FIFO 0 interrupts are raised.
  *          This parameter can be any combination of the following values:
  *           @arg @ref HAL_FDCAN_FLAG_RX_FIFO_0_MSG_LOST
  *           @arg @ref HAL_FDCAN_FLAG_RX_FIFO_0_FULL
  *           @arg @ref HAL_FDCAN_FLAG_RX_FIFO_0_NEW_MSG
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__WEAK void HAL_FDCAN_RxFifo0Callback(hal_fdcan_handle_t *hfdcan, uint32_t rx_fifo0_interrupts)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hfdcan);
  STM32_UNUSED(rx_fifo0_interrupts);

  /* WARNING: This function must not be modified. When the callback is needed,
           function HAL_FDCAN_RxFifo0Callback must be implemented in the user file.
   */
}

/**
  * @brief   Rx FIFO 1 callback.
  * @param   hfdcan              Pointer to a @ref hal_fdcan_handle_t handle.
  * @param   rx_fifo1_interrupts Indicates which Rx FIFO 1 interrupts are raised.
  *          This parameter can be any combination of the following values:
  *          @arg @ref HAL_FDCAN_FLAG_RX_FIFO_1_MSG_LOST
  *          @arg @ref HAL_FDCAN_FLAG_RX_FIFO_1_FULL
  *          @arg @ref HAL_FDCAN_FLAG_RX_FIFO_1_NEW_MSG
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__WEAK void HAL_FDCAN_RxFifo1Callback(hal_fdcan_handle_t *hfdcan, uint32_t rx_fifo1_interrupts)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hfdcan);
  STM32_UNUSED(rx_fifo1_interrupts);

  /* WARNING: This function must not be modified. When the callback is needed,
           function HAL_FDCAN_RxFifo1Callback must be implemented in the user file.
   */
}

/**
  * @brief   Tx FIFO Empty callback.
  * @param   hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__WEAK void HAL_FDCAN_TxFifoEmptyCallback(hal_fdcan_handle_t *hfdcan)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hfdcan);

