MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  /* WARNING: This function must not be modified. When the callback is needed,
           function HAL_FDCAN_TxFifoEmptyCallback must be implemented in the user file.
   */
}

/**
  * @brief   Transmission complete callback.
  * @param   hfdcan         Pointer to a @ref hal_fdcan_handle_t handle.
  * @param   tx_buffers_idx Indexes of the transmitted buffers.
  *          This parameter can be any combination of @ref FDCAN_IT_Tx_Complete_Buffers_Select.
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__WEAK void HAL_FDCAN_TxBufferCompleteCallback(hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hfdcan);
  STM32_UNUSED(tx_buffers_idx);

  /* WARNING: This function must not be modified. When the callback is needed,
           function HAL_FDCAN_TxBufferCompleteCallback must be implemented in the user file.
   */
}

/**
  * @brief   Transmission cancellation callback.
  * @param   hfdcan         Pointer to a @ref hal_fdcan_handle_t handle.
  * @param   tx_buffers_idx Indexes of the aborted buffers.
  *          This parameter can be any combination of @ref FDCAN_IT_Tx_Abort_Buffers_Select.
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__WEAK void HAL_FDCAN_TxBufferAbortCallback(hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hfdcan);
  STM32_UNUSED(tx_buffers_idx);

  /* WARNING: This function must not be modified. When the callback is needed,
           function HAL_FDCAN_TxBufferAbortCallback must be implemented in the user file.
   */
}

/**
  * @brief   High priority message callback.
  * @param   hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__WEAK void HAL_FDCAN_HighPriorityMessageCallback(hal_fdcan_handle_t *hfdcan)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hfdcan);

  /* WARNING: This function must not be modified. When the callback is needed,
           function HAL_FDCAN_HighPriorityMessageCallback must be implemented in the user file.
   */
}

/**
  * @brief   Timestamp wrap around callback.
  * @param   hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__WEAK void HAL_FDCAN_TimestampWraparoundCallback(hal_fdcan_handle_t *hfdcan)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hfdcan);

  /* WARNING: This function must not be modified. When the callback is needed,
           function HAL_FDCAN_TimestampWraparoundCallback must be implemented in the user file.
   */
}

/**
  * @brief   Error callback.
  * @param   hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @note    The hfdcan handle's last_error_codes parameter is updated by the FDCAN processes,
  *          and the user can use HAL_FDCAN_GetLastErrorCodes() to verify the most recent error that occurred.
  * @warning This weak function must not be modified. When the callback is needed,
  *          it must be implemented in the user file.
  */
__WEAK void HAL_FDCAN_ErrorCallback(hal_fdcan_handle_t *hfdcan)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hfdcan);

  /* WARNING: This function must not be modified. When the callback is needed,
           function HAL_FDCAN_ErrorCallback must be implemented in the user file.
   */
}


/**
  * @}
  */

/** @addtogroup FDCAN_Exported_Functions_Group8
  * @{
A set of functions allowing to process with the state and last process errors.
  - HAL_FDCAN_GetState()            : Get the FDCAN state.
  - HAL_FDCAN_GetLastErrorCodes()   : Get the last error codes limited to the last process.
  */

/**
  * @brief  Return the FDCAN state.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Current HAL FDCAN state.
  */
hal_fdcan_state_t HAL_FDCAN_GetState(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  /* Return FDCAN handle state */
  return hfdcan->global_state;
}

#if defined(USE_HAL_FDCAN_GET_LAST_ERRORS) && (USE_HAL_FDCAN_GET_LAST_ERRORS == 1)
/**
  * @brief  Return the FDCAN error code.
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @return Last error code. This parameter can be any combination of @ref FDCAN_Error_Codes.
 */
uint32_t HAL_FDCAN_GetLastErrorCodes(const hal_fdcan_handle_t *hfdcan)
{
  ASSERT_DBG_PARAM((hfdcan != NULL));

  /* Return FDCAN error code */
  return hfdcan->last_error_codes;
}
#endif /* USE_HAL_FDCAN_GET_LAST_ERRORS */

/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @addtogroup FDCAN_Exported_Functions_Group9
  * @{
A set of functions allowing to Acquire/Release the bus based on the HAL OS abstraction layer (stm32_hal_os.c/.h osal):
    - HAL_FDCAN_AcquireBus(): Acquire the FDCAN bus.
    - HAL_FDCAN_ReleaseBus(): Release the FDCAN bus.
  */

/**
  * @brief  Acquire the FDCAN bus through the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hfdcan     Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  timeout_ms Timeout duration in millisecond.
  * @note   HAL_FDCAN_AcquireBus() must be called from thread mode only (not from handler mode i.e from ISR).
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Semaphore cannot be taken.
  */
hal_status_t HAL_FDCAN_AcquireBus(hal_fdcan_handle_t *hfdcan, uint32_t timeout_ms)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hfdcan != NULL));

  if (HAL_OS_SemaphoreTake(&hfdcan->semaphore, timeout_ms) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Release the FDCAN bus through the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hfdcan Pointer to a @ref hal_fdcan_handle_t handle.
  * @note   HAL_FDCAN_ReleaseBus() can be called from thread mode or from handler mode i.e from ISR.
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Semaphore cannot be released.
  */
hal_status_t HAL_FDCAN_ReleaseBus(hal_fdcan_handle_t *hfdcan)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hfdcan != NULL));

