MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  if (HAL_OS_SemaphoreRelease(&hfdcan->semaphore) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined(USE_HAL_FDCAN_USER_DATA) && (USE_HAL_FDCAN_USER_DATA == 1)
/** @addtogroup FDCAN_Exported_Functions_Group10
  * @{
A set of functions allowing to manage a user data pointer stored to the FDCAN handle:
  - HAL_FDCAN_SetUserData() : Configure the user data into the handle
  - HAL_FDCAN_GetUserData() : Get the user data from the handle
  */

/**
  * @brief Set the user data pointer into the handle.
  * @param hfdcan      Pointer to a hal_fdcan_handle_t.
  * @param p_user_data Pointer to the user data.
  */
void HAL_FDCAN_SetUserData(hal_fdcan_handle_t *hfdcan, const void *p_user_data)
{
  /* Check the FDCAN handle allocation */
  ASSERT_DBG_PARAM((hfdcan != NULL));

  hfdcan->p_user_data = p_user_data;
}
/**
  * @brief  Get the user data pointer from the handle.
  * @param  hfdcan Pointer to a hal_fdcan_handle_t.
  * @return Current pointer to the user data.
  */
const void *HAL_FDCAN_GetUserData(const hal_fdcan_handle_t *hfdcan)
{
  /* Check the FDCAN handle allocation */
  ASSERT_DBG_PARAM((hfdcan != NULL));

  return (hfdcan->p_user_data);
}

/**
  * @}
  */
#endif /* USE_HAL_FDCAN_USER_DATA == 1 */


/**
  * @}
  */

/* Private function implementations ----------------------------------------------------------------------------------*/
/** @addtogroup FDCAN_Private_Functions
  * @{
This section contains static functions used internally by the FDCAN HAL module to:
     - Configure nominal and data bit timing parameters.
     - Compute message RAM block addresses based on configuration.
     - Copy transmit messages into the message RAM.
     - Retrieve and interpret the FDCAN operating mode.
     - Wait on hardware flags with timeout handling.
     - Manage clock stop requests and acknowledgments.

  These functions are not exposed to the user application and are intended solely for internal
  driver operations to ensure modularity, maintainability, and encapsulation of hardware-specific logic.

  Usage of these functions is limited to within the FDCAN HAL driver source file.
  */

/**
  * @brief  Set the FDCAN nominal bit timing configuration.
  * @param  fdcan Pointer to a FDCANx hardware instance.
  * @param  p_timing Pointer to nominal bit timing structure @ref hal_fdcan_nominal_bit_timing_t.
  */
static void FDCAN_SetNominalBitTiming(FDCAN_GlobalTypeDef *fdcan, const hal_fdcan_nominal_bit_timing_t *p_timing)
{
  uint32_t register_value = ((p_timing->nominal_prescaler - 1U) << FDCAN_NBTP_NBRP_Pos)
                            | ((p_timing->nominal_jump_width - 1U) << FDCAN_NBTP_NSJW_Pos)
                            | ((p_timing->nominal_time_seg1 - 1U) << FDCAN_NBTP_NTSEG1_Pos)
                            | ((p_timing->nominal_time_seg2 - 1U) << FDCAN_NBTP_NTSEG2_Pos);

  STM32_WRITE_REG(fdcan->NBTP, register_value);
}

/**
  * @brief  Get the FDCAN nominal bit timing configuration.
  * @param  fdcan Pointer to a FDCANx hardware instance.
  * @param  p_timing Pointer to the nominal bit timing structure @ref hal_fdcan_nominal_bit_timing_t to be
  *         filled with current configuration.
  */
static void FDCAN_GetNominalBitTiming(const FDCAN_GlobalTypeDef *fdcan, hal_fdcan_nominal_bit_timing_t *p_timing)
{
  uint32_t register_value = STM32_READ_REG(fdcan->NBTP);

  p_timing->nominal_prescaler  = (STM32_READ_BIT(register_value, FDCAN_NBTP_NBRP) >> FDCAN_NBTP_NBRP_Pos) + 1U;
  p_timing->nominal_jump_width = (STM32_READ_BIT(register_value, FDCAN_NBTP_NSJW) >> FDCAN_NBTP_NSJW_Pos) + 1U;
  p_timing->nominal_time_seg1  = (STM32_READ_BIT(register_value, FDCAN_NBTP_NTSEG1) >> FDCAN_NBTP_NTSEG1_Pos) + 1U;
  p_timing->nominal_time_seg2  = (STM32_READ_BIT(register_value, FDCAN_NBTP_NTSEG2) >> FDCAN_NBTP_NTSEG2_Pos) + 1U;
}

/**
  * @brief  Set the FDCAN data bit timing configuration.
  * @param  fdcan Pointer to a FDCANx hardware instance.
  * @param  p_timing Pointer to data bit timing structure @ref hal_fdcan_data_bit_timing_t.
  */
static void FDCAN_SetDataBitTiming(FDCAN_GlobalTypeDef *fdcan, const hal_fdcan_data_bit_timing_t *p_timing)
{
  uint32_t register_value = ((uint32_t)(p_timing->data_prescaler - 1U) << FDCAN_DBTP_DBRP_Pos)
                            | ((uint32_t)(p_timing->data_jump_width - 1U) << FDCAN_DBTP_DSJW_Pos)
                            | ((uint32_t)(p_timing->data_time_seg1 - 1U) << FDCAN_DBTP_DTSEG1_Pos)
                            | ((uint32_t)(p_timing->data_time_seg2 - 1U) << FDCAN_DBTP_DTSEG2_Pos);

  STM32_WRITE_REG(fdcan->DBTP, register_value);
}

/**
  * @brief  Get the FDCAN data bit timing configuration.
  * @param  fdcan Pointer to a FDCANx hardware instance.
  * @param  p_timing Pointer to the data bit timing structure @ref hal_fdcan_data_bit_timing_t to be
  *         filled with current configuration.
  */
static void FDCAN_GetDataBitTiming(const FDCAN_GlobalTypeDef *fdcan, hal_fdcan_data_bit_timing_t *p_timing)
{
  uint32_t register_value = STM32_READ_REG(fdcan->DBTP);

  p_timing->data_time_seg2  = (STM32_READ_BIT(register_value, FDCAN_DBTP_DTSEG2_Msk) >> FDCAN_DBTP_DTSEG2_Pos) + 1U;
  p_timing->data_time_seg1  = (STM32_READ_BIT(register_value, FDCAN_DBTP_DTSEG1_Msk) >> FDCAN_DBTP_DTSEG1_Pos) + 1U;
  p_timing->data_prescaler  = (STM32_READ_BIT(register_value, FDCAN_DBTP_DBRP_Msk) >> FDCAN_DBTP_DBRP_Pos) + 1U;
  p_timing->data_jump_width = (STM32_READ_BIT(register_value, FDCAN_DBTP_DSJW_Msk) >> FDCAN_DBTP_DSJW_Pos) + 1U;
}

/**
  * @brief  Calculate each RAM block start address and size.
  * @param  hfdcan   Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_config Pointer to a global configuration structure.
 */
static void FDCAN_ComputeRAMBlockAddresses(hal_fdcan_handle_t *hfdcan, const hal_fdcan_config_t *p_config)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  uint32_t ram_counter;
  uint32_t sram_can_instance_base = SRAMCAN_BASE;

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

#if defined(FDCAN2)
  if (p_fdcanx == FDCAN2)
  {
    sram_can_instance_base += FDCAN_RAM_SIZE;
  }
#endif /* FDCAN2 */

  /* Assign start addresses for each RAM block */
  hfdcan->msg_ram.std_filter_start_addr = sram_can_instance_base + FDCAN_RAM_FLSSA;
  hfdcan->msg_ram.ext_filter_start_addr = sram_can_instance_base + FDCAN_RAM_FLESA;
  hfdcan->msg_ram.rx_fifo0_start_addr   = sram_can_instance_base + FDCAN_RAM_RF0SA;
  hfdcan->msg_ram.rx_fifo1_start_addr   = sram_can_instance_base + FDCAN_RAM_RF1SA;
  hfdcan->msg_ram.tx_event_start_addr   = sram_can_instance_base + FDCAN_RAM_TEFSA;
  hfdcan->msg_ram.tx_fifo_start_addr    = sram_can_instance_base + FDCAN_RAM_TFQSA;

  /* Configure filter element numbers in hardware */
  STM32_MODIFY_REG(p_fdcanx->RXGFC, FDCAN_RXGFC_LSS, (p_config->std_filters_nbr << FDCAN_RXGFC_LSS_Pos));
  STM32_MODIFY_REG(p_fdcanx->RXGFC, FDCAN_RXGFC_LSE, (p_config->ext_filters_nbr << FDCAN_RXGFC_LSE_Pos));

  /* Flush the allocated message RAM area */
  for (ram_counter = sram_can_instance_base; ram_counter < (sram_can_instance_base + FDCAN_RAM_SIZE); ram_counter += 4U)
  {
    *(uint32_t *)(ram_counter) = 0x00000000U;
  }
}

/**
  * @brief  Get the FDCAN messgage RAM configuration.
  * @param  p_fdcan  Pointer to a FDCANx hardware instance.
  * @param  p_config Pointer to the configuration structure to be filled with current configuration.
  *                  filled with current configuration.
  */
static void FDCAN_GetMessageRAMConfig(const FDCAN_GlobalTypeDef *p_fdcan, hal_fdcan_config_t *p_config)
{
  uint32_t register_value = STM32_READ_REG(p_fdcan->RXGFC);

  p_config->std_filters_nbr = STM32_READ_BIT(register_value, FDCAN_RXGFC_LSS) >> FDCAN_RXGFC_LSS_Pos;
  p_config->ext_filters_nbr = STM32_READ_BIT(register_value, FDCAN_RXGFC_LSE) >> FDCAN_RXGFC_LSE_Pos;
}

/**
  * @brief  Copy Tx message to the message RAM.
  * @param  hfdcan        Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  p_tx_header   Pointer to a @ref hal_fdcan_tx_header_t structure containing the Tx header.
  * @param  p_tx_data     Pointer to a buffer containing the payload of the Tx frame.
  * @param  tx_buffer_idx Bit position of the Tx buffer to be filled (0 for buffer 0, 1 for buffer 1, etc).
 */
static void FDCAN_CopyMessageToRAM(const hal_fdcan_handle_t *hfdcan, const hal_fdcan_tx_header_t *p_tx_header,
                                   const uint8_t *p_tx_data, uint32_t tx_buffer_idx)
{
  uint32_t *tx_address;
  uint32_t word_count;
  uint32_t payload_bytes = FDCAN_GET_DATA_LENGTH_BYTES(p_tx_header->b.data_length);
  const uint8_t *p_data = p_tx_data;
  /* Calculate Tx element address */
  tx_address = (uint32_t *)(hfdcan->msg_ram.tx_fifo_start_addr + (tx_buffer_idx * FDCAN_RAM_TFQ_SIZE));

  /* Write the Tx header (64 bits = 2 x 32 bits) */
  tx_address[0U] = (uint32_t)(p_tx_header->d64 & 0x00000000FFFFFFFFU);
  tx_address[1U] = (uint32_t)(p_tx_header->d64 >> 32U);

  /* Move pointer past header */
  tx_address = &tx_address[2U];

  /* Write Tx payload to the message RAM in 32-bit words */
  word_count = payload_bytes >> 2U;
  while (word_count > 0U)
  {
    *tx_address = (((uint32_t)p_data[3U] << 24U)
                   | ((uint32_t)p_data[2U] << 16U)
                   | ((uint32_t)p_data[1U] << 8U)
                   | (uint32_t)p_data[0U]);

    p_data = &p_data[4U];
    tx_address++;
    word_count--;
  }

