MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  /* Handle remaining bytes if Data Length Code (DLC) is not a multiple of 4 */
  switch (payload_bytes & 0x3U)
  {
    case 3U:
      *tx_address = ((uint32_t)p_data[2U] << 16U) | ((uint32_t)p_data[1U] << 8U) | (uint32_t)p_data[0U];
      break;

    case 2U:
      *tx_address = ((uint32_t)p_data[1U] << 8U) | (uint32_t)p_data[0U];
      break;

    case 1U:
      *tx_address = (uint32_t)p_data[0U];
      break;

    default:
      /* Nothing to write */
      break;
  }
}

/**
  * @brief  Retrieve the FDCAN mode.
  * @param  register_value Specifies the FDCAN_CCCR register value.
  * @retval Current fdcan operation mode.
  */
static hal_fdcan_mode_t FDCAN_GetMode(const uint32_t register_value)
{
  hal_fdcan_mode_t selection_mode;

  /* Read the ASM, MON, and TEST bits from FDCAN_CCCR register */
  selection_mode = (hal_fdcan_mode_t)(uint32_t)STM32_READ_BIT(register_value,
                                                              FDCAN_CCCR_ASM | FDCAN_CCCR_MON | FDCAN_CCCR_TEST);

  switch ((uint32_t)selection_mode)
  {
    case HAL_FDCAN_MODE_EXTERNAL_LOOPBACK:
    case HAL_FDCAN_MODE_INTERNAL_LOOPBACK:
    case HAL_FDCAN_MODE_NORMAL:
    case HAL_FDCAN_MODE_RESTRICTED_OPERATION:
    case HAL_FDCAN_MODE_BUS_MONITORING:
      /* Valid modes, do nothing */
      break;

    default:
      /* All other configs are invalid */
      selection_mode = HAL_FDCAN_MODE_INVALID;
      break;
  }

  return selection_mode;
}

/**
  * @brief  Wait for a flag to reach a given status until timeout.
  * @param  fdcan       Pointer to a FDCANx hardware instance.
  * @param  flag        Specifies the FDCAN flag to check in CCCR register.
  * @param  status      The new flag status (0U or the flag value in register).
  * @param  timeout_ms  Timeout duration in millisecond.
  * @retval HAL_TIMEOUT Timeout exceeded.
  * @retval HAL_OK      Operation completed successfully.
  */
static hal_status_t FDCAN_WaitOnFlagUntilTimeout(const FDCAN_GlobalTypeDef *fdcan, uint32_t flag, uint32_t status,
                                                 uint32_t timeout_ms)
{
  /* Init tickstart for timeout management */
  uint32_t tickstart = HAL_GetTick();

  hal_status_t tmp_status = HAL_OK;

  while (STM32_READ_BIT(fdcan->CCCR, flag) == status)
  {
    /* Check for the timeout */
    if ((HAL_GetTick() - tickstart) > timeout_ms)
    {
      if (STM32_READ_BIT(fdcan->CCCR, flag) == status)
      {
        tmp_status = HAL_TIMEOUT;
      }
      break;
    }
  }
  return tmp_status;
}

/**
  * @brief  Clock stop request and wait for acknowledge.
  * @param  fdcan      Pointer to a FDCANx hardware instance.
  * @retval HAL_ERROR  No clock stop acknowledged.
  * @retval HAL_OK     Clock stop acknowledged.
  */
static hal_status_t FDCAN_ResetClockStopRequest(FDCAN_GlobalTypeDef *fdcan)
{
  /* Reset clock stop request */
  STM32_CLEAR_BIT(fdcan->CCCR, FDCAN_CCCR_CSR);

  /* Wait until FDCAN clock stop acknowledged */
  if (FDCAN_WaitOnFlagUntilTimeout(fdcan, FDCAN_CCCR_CSA, FDCAN_CCCR_CSA, FDCAN_GLOBAL_TIMEOUT_MS) != HAL_TIMEOUT)
  {
    return HAL_OK;
  }

  return HAL_ERROR;
}

/**
  * @brief  Initialization request and wait for acknowledge.
  * @param  fdcan      Pointer to a FDCANx hardware instance.
  * @retval HAL_ERROR  No Initialization acknowledged.
  * @retval HAL_OK     Initialization acknowledged.
  */
static hal_status_t FDCAN_InitRequest(FDCAN_GlobalTypeDef *fdcan)
{
  /* Request initialisation */
  STM32_SET_BIT(fdcan->CCCR, FDCAN_CCCR_INIT);

  /* Wait until the initialisation is accepted */
  if (FDCAN_WaitOnFlagUntilTimeout(fdcan, FDCAN_CCCR_INIT, 0U, FDCAN_GLOBAL_TIMEOUT_MS) != HAL_TIMEOUT)
  {
    return HAL_OK;
  }

  return HAL_ERROR;
}


/**
  * @brief  Compute line-specific interrupt flags from current pending+enabled interrupts.
  * @param  p_fdcanx Pointer to FDCAN registers.
  * @param  it_line  Interrupt line selector.
  * @retval Filtered interrupt flags for the requested line.
  */
static uint32_t FDCAN_GetLineSpecificInterruptFlags(const FDCAN_GlobalTypeDef *p_fdcanx, uint32_t it_line)
{
  uint32_t it_flags;

  /* Read FDCAN interrupt register and keep only currently enabled interrupt sources. */
  it_flags = STM32_READ_REG(p_fdcanx->IR);
  it_flags &= STM32_READ_REG(p_fdcanx->IE);

  uint32_t line1_groups = STM32_READ_REG(p_fdcanx->ILS) & HAL_FDCAN_IT_GROUP_MSK;
  uint32_t line1_mask = 0U;

  if ((line1_groups & HAL_FDCAN_IT_GROUP_RX_FIFO_0) != 0U)
  {
    line1_mask |= FDCAN_RX_FIFO_0_MSK;
  }
  if ((line1_groups & HAL_FDCAN_IT_GROUP_RX_FIFO_1) != 0U)
  {
    line1_mask |= FDCAN_RX_FIFO_1_MSK;
  }
  if ((line1_groups & HAL_FDCAN_IT_GROUP_STATUS_MSG) != 0U)
  {
    line1_mask |= (FDCAN_IR_HPM | FDCAN_IR_TC | FDCAN_IR_TCF);
  }
  if ((line1_groups & HAL_FDCAN_IT_GROUP_TX_FIFO_ERROR) != 0U)
  {
    line1_mask |= (FDCAN_IR_TFE | FDCAN_TX_EVENT_FIFO_MSK);
  }
  if ((line1_groups & HAL_FDCAN_IT_GROUP_MISC) != 0U)
  {
    line1_mask |= (FDCAN_IR_TSW | FDCAN_IR_MRAF | FDCAN_IR_TOO);
  }
  if ((line1_groups & HAL_FDCAN_IT_GROUP_BIT_LINE_ERROR) != 0U)
  {
    line1_mask |= (FDCAN_IR_ELO | FDCAN_IR_EP);
  }
  if ((line1_groups & HAL_FDCAN_IT_GROUP_PROTOCOL_ERROR) != 0U)
  {
    line1_mask |= (FDCAN_IR_EW | FDCAN_IR_BO | FDCAN_IR_WDI | FDCAN_IR_PEA | FDCAN_IR_PED | FDCAN_IR_ARA);
  }

  return ((it_line == HAL_FDCAN_IT_LINE_1) ? (it_flags & line1_mask)
          : (it_flags & ((~line1_mask) & FDCAN_IR_MSK)));
}

/**
  * @brief  Process a prepared list of FDCAN interrupt flags.
  * @param  hfdcan   Pointer to a @ref hal_fdcan_handle_t handle.
  * @param  it_flags Interrupt flags to process.
  */
static void FDCAN_HandleInterruptFlags(hal_fdcan_handle_t *hfdcan, uint32_t it_flags)
{
  FDCAN_GlobalTypeDef *p_fdcanx;
  uint32_t specific_its;
  uint32_t transmitted_buffers;
  uint32_t aborted_buffers;

  p_fdcanx = FDCAN_GET_INSTANCE(hfdcan);

  /* High priority message interrupt management: FDCAN_IR_HPM */
  if (STM32_IS_BIT_SET(it_flags, FDCAN_IR_HPM) != 0U)
  {
    /* Clear the high priority message flag */
    STM32_WRITE_REG(p_fdcanx->IR, FDCAN_IR_HPM);

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1)
    /* Call registered callback */
    hfdcan->p_high_priority_msg_cb(hfdcan);
#else
    /* High priority message callback */
    HAL_FDCAN_HighPriorityMessageCallback(hfdcan);
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */
  }

