MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.c
  /* Read if there is an IT related to Rx FIFO 0 group:
        - Rx FIFO 0 new message interrupt       - RF0N
        - Rx FIFO 0 full interrupt              - RF0F
        - Rx FIFO 0 message lost interrupt      - RF0L          */
  specific_its = it_flags & FDCAN_RX_FIFO_0_MSK;

  /* Rx FIFO 0 interrupts management: FDCAN_IR_RF0L, FDCAN_IR_RF0F, FDCAN_IR_RF0N */
  if (specific_its != 0U)
  {
    /* Clear the Rx FIFO 0 flags */
    STM32_WRITE_REG(p_fdcanx->IR, specific_its);

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1)
    /* Call registered callback */
    hfdcan->p_rx_fifo_0_cb(hfdcan, specific_its);
#else
    /* Rx FIFO 0 callback */
    HAL_FDCAN_RxFifo0Callback(hfdcan, specific_its);
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */
  }

  /* Read if there is an IT related to Rx FIFO 1 group:
        - Rx FIFO 1 new message interrupt       - RF1N
        - Rx FIFO 1 full interrupt              - RF1F
        - Rx FIFO 1 message lost interrupt      - RF1L          */
  specific_its = it_flags & FDCAN_RX_FIFO_1_MSK;

  /* Rx FIFO 1 interrupts management: FDCAN_IR_RF1L, FDCAN_IR_RF1F, FDCAN_IR_RF1N */
  if (specific_its != 0U)
  {
    /* Clear the Rx FIFO 1 flags */
    STM32_WRITE_REG(p_fdcanx->IR, specific_its);

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1)
    /* Call registered callback */
    hfdcan->p_rx_fifo_1_cb(hfdcan, specific_its);
#else
    /* Rx FIFO 1 callback */
    HAL_FDCAN_RxFifo1Callback(hfdcan, specific_its);
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */
  }

  /* Transmission abort interrupt management: FDCAN_IE_TCFE */
  if (STM32_IS_BIT_SET(it_flags, FDCAN_IR_TCF) != 0U)
  {
    /* List of aborted monitored buffers */
    aborted_buffers = STM32_READ_REG(p_fdcanx->TXBCF);
    aborted_buffers &= STM32_READ_REG(p_fdcanx->TXBCIE);

    /* Clear the transmission cancellation flag */
    STM32_WRITE_REG(p_fdcanx->IR, FDCAN_IR_TCF);

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1)
    /* Call registered callback */
    hfdcan->p_tx_buffer_abort_cb(hfdcan, aborted_buffers);
#else
    /* Transmission cancellation callback */
    HAL_FDCAN_TxBufferAbortCallback(hfdcan, aborted_buffers);
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */
  }

  /* Read if there is an IT related to Tx event group:
        - Tx event FIFO new entry interrupt     - TEFN
        - Tx event FIFO full interrupt          - TEFF
        - Tx event FIFO element lost interrupt  - TEFL          */
  specific_its = it_flags & FDCAN_TX_EVENT_FIFO_MSK;

  /* Tx event FIFO interrupts management: FDCAN_IR_TEFL, FDCAN_IR_TEFF, FDCAN_IR_TEFN */
  if (specific_its != 0U)
  {
    /* Clear the Tx event FIFO flags */
    STM32_WRITE_REG(p_fdcanx->IR, specific_its);

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1)
    /* Call registered callback */
    hfdcan->p_tx_event_fifo_cb(hfdcan, specific_its);
#else
    /* Tx event FIFO callback */
    HAL_FDCAN_TxEventFifoCallback(hfdcan, specific_its);
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */
  }

  /* Tx FIFO empty interrupt management: FDCAN_IR_TFE */
  if (STM32_IS_BIT_SET(it_flags, FDCAN_IR_TFE) != 0U)
  {
    /* Clear the Tx FIFO empty flag */
    STM32_WRITE_REG(p_fdcanx->IR, FDCAN_IR_TFE);

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1)
    /* Call registered callback */
    hfdcan->p_tx_fifo_empty_cb(hfdcan);
#else
    /* Tx FIFO empty callback */
    HAL_FDCAN_TxFifoEmptyCallback(hfdcan);
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */
  }

  /* Transmission complete interrupt management: FDCAN_IR_TC */
  if (STM32_IS_BIT_SET(it_flags, FDCAN_IR_TC) != 0U)
  {
    /* List of transmitted monitored buffers */
    transmitted_buffers = STM32_READ_REG(p_fdcanx->TXBTO);
    transmitted_buffers &= STM32_READ_REG(p_fdcanx->TXBTIE);

    /* Clear the transmission complete flag */
    STM32_WRITE_REG(p_fdcanx->IR, FDCAN_IR_TC);

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1)
    /* Call registered callback */
    hfdcan->p_tx_buffer_complete_cb(hfdcan, transmitted_buffers);
#else
    /* Transmission complete callback */
    HAL_FDCAN_TxBufferCompleteCallback(hfdcan, transmitted_buffers);
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */
  }

  /* Timestamp wrap around interrupt management: FDCAN_IR_TSW */
  if (STM32_IS_BIT_SET(it_flags, FDCAN_IR_TSW) != 0U)
  {
    /* Clear the timestamp wrap around flag */
    STM32_WRITE_REG(p_fdcanx->IR, FDCAN_IR_TSW);

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1)
    /* Call registered callback */
    hfdcan->p_ts_wraparound_cb(hfdcan);
#else
    /* Timestamp wrap around callback */
    HAL_FDCAN_TimestampWraparoundCallback(hfdcan);
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */
  }

  /* Error FDCAN interrupts management:
        - Error logging overflow interrupt      - ELO
        - Watchdog interrupt                    - WDI
        - Protocol error in arbitration phase   - PEA
        - Protocol error in data phase          - PED
        - Access to reserved address            - ARA
        - Message RAM access failure            - MRAF
        - Timeout occurred                      - TOO
        - Bus_Off                               - BO
        - Warning status                        - EW
        - Error passive                         - EP  */

  specific_its = it_flags & (FDCAN_IR_EP | FDCAN_IR_EW | FDCAN_IR_BO | FDCAN_IR_ELO | FDCAN_IR_WDI | FDCAN_IR_PEA
                             | FDCAN_IR_PED | FDCAN_IR_ARA | FDCAN_IR_TOO | FDCAN_IR_MRAF);

  if (specific_its != 0U)
  {
    /* Clear the error flags */
    STM32_WRITE_REG(p_fdcanx->IR, specific_its);

#if defined(USE_HAL_FDCAN_GET_LAST_ERRORS) && (USE_HAL_FDCAN_GET_LAST_ERRORS == 1)
    /* Update the last_error_codes according to the detected error flags */
    hfdcan->last_error_codes |= specific_its;
#endif /* USE_HAL_FDCAN_GET_LAST_ERRORS */

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1)
    /* Call registered callback */
    hfdcan->p_error_cb(hfdcan);
#else
    /* Error callback */
    HAL_FDCAN_ErrorCallback(hfdcan);
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */
  }
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_FDCAN_MODULE */
#endif /* FDCAN1 || FDCAN2 */

/**
  * @}
  */
